Platina

GoES Command Line Guide

Platina Systems

Version-0.1

*Date-28 August 2018*

Table of Contents

[Chapter-1 Overview](#_mj05z6gmuigq)

Chapter-2 GoES Linux Commands

[**2.1 goes-commands**](#_fv04ufbo5iar)

[2.1.1 goes
help](#GoesHelp)............................................................................................................................................................\....
9

[2.1.2 goes
man](#GoesMan)...............................................................................................................................................................
10

[2.1.3 goes
usage](#GoesUsage)............................................................................................................................................................
11

**[2.2 goes
apropos](#GOESapropos)........................................................................................................................................................
11**

[2.2.1 goes !
help](#goes1)............................................................................................................................................................
14

[2.2.2 goes /init
help](#init)......................................................................................................................................................
14

[2.2.3 goes \[
help](#goes2).........................................................................................................................................................\...
15

[2.2.4 goes
bootc](#bootc).........................................................................................................................................................\...
16

[2.2.5 goes
bootd](#bootd).........................................................................................................................................................\....
17

[2.2.6 goes
cat](#cat)...............................................................................................................................................................\...
17

[2.2.7 goes
cd](#cd)............................................................................................................................................................\...\...
19

[2.2.8 goes
chmod](#chmod)...........................................................................................................................................................
20

2.2.9 goes
cli..................................................................................................................................................................
21

[2.2.10 goes
cp](#cp)...................................................................................................................................................................
21

[2.2.11 goes
dmesg](#dmesg)...........................................................................................................................................................
22

[2.2.12 goes
echo](#echo)..............................................................................................................................................................
25

[2.2.13 goes
eeprom](#eeprom).........................................................................................................................................................
26

[2.2.14 goes
else](#else)................................................................................................................................................................
26

[2.2.15 goes
env](#env)................................................................................................................................................................
27

[2.2.16 goes
exec](#exec)...............................................................................................................................................................
28

[2.2.17 goes
exit](#exit)................................................................................................................................................................
28

[2.2.18 goes
export](#export)............................................................................................................................................................
29

[2.2.19 goes
false](#false)...............................................................................................................................................................
30

[2.2.20 goes
femtocom](#femtocom).....................................................................................................................................................
30

[2.2.21 goes
fi](#fi).....................................................................................................................................................................
31

[2.2.22 goes
function](#function).........................................................................................................................................................
32

[2.2.23 goes
goes-daemons](#goesdaemons)..............................................................................................................................................
32

[2.2.24 goes
gpio](#gpio)................................................................................................................................................................
33

[2.2.25 goes
hdel](#hdel)................................................................................................................................................................
33

[2.2.26 goes
hdelta](#hdelta).............................................................................................................................................................
34

[2.2.27 goes
hexists](#hexists)............................................................................................................................................................
35

[2.2.28 goes
hget](#hget)................................................................................................................................................................
35

[2.2.29 goes
hgetall](#hgetall)............................................................................................................................................................
36

[2.2.30 goes
hkeys](#hkeys)..............................................................................................................................................................
36

[2.2.31 goes
hset](#hset)................................................................................................................................................................
37

[2.2.32 goes
hwait](#hwait)..............................................................................................................................................................
38

[2.2.33 goes
if](#if).....................................................................................................................................................................
38

[2.2.34 goes
insmod](#insmod)..........................................................................................................................................................
39

[2.2.35 goes
install](#install).............................................................................................................................................................
40

[2.2.36 goes
io](#io)....................................................................................................................................................................
40

[2.2.37 goes
ip](#ip)....................................................................................................................................................................
42

[2.2.38 goes
kexec](#kexec).............................................................................................................................................................
43

[2.2.39 goes
keys](#keys)................................................................................................................................................................
43

[2.2.40 goes
kill](#kill)...................................................................................................................................................................
44

[2.2.41 goes
ln](#ln)....................................................................................................................................................................
45

[2.2.42 goes
log](#log)..................................................................................................................................................................
45

[2.2.43 goes
ls](#ls).....................................................................................................................................................................
46

[2.2.44 goes
lsmod](#lsmod).............................................................................................................................................................
47

[2.2.45 goes
mkdir](#mkdir)..............................................................................................................................................................
49

[2.2.46 goes
mknod](#mknod)............................................................................................................................................................
50

[2.2.47 goes
mount](#mount).............................................................................................................................................................
50

[2.2.48 goes
ping](#ping).................................................................................................................................................................
51

[2.2.49 goes
ps](#ps).....................................................................................................................................................................
52

[2.2.50 goes
pwd](#pwd)..................................................................................................................................................................
52

[2.2.51 goes
qsfp](#qsfp)..................................................................................................................................................................
53

[2.2.52 goes
reboot](#rebooot).............................................................................................................................................................
54

[2.2.53 goes
redisd](#redisd)..............................................................................................................................................................
54

[2.2.54 goes
reload](#reload)..............................................................................................................................................................
55

[2.2.55 goes
restart](#restart)..............................................................................................................................................................
56

[2.2.56 goes
rm](#rm).....................................................................................................................................................................
56

[2.2.57 goes
rmmod](#rmmod).............................................................................................................................................................
58

[2.2.58 goes
show](#show)................................................................................................................................................................
58

[2.2.59 goes
sleep](#sleep)................................................................................................................................................................
59

[2.2.60 goes
source](#source)..............................................................................................................................................................
59

[2.2.61 goes
start](#start).................................................................................................................................................................
60

[2.2.62 goes
status..............................................................................................................................................................
61](\l)

[2.2.63 goes
stop..................................................................................................................................................................
62](\l)[2.2.64 goes
stty](#stty)...................................................................................................................................................................
62

[2.2.65 goes
subscribe](#subscribe).........................................................................................................................................................
64

[2.2.66 goes
sync](#sync)..................................................................................................................................................................
64

[2.2.67 goes
tempd](#tempd)..............................................................................................................................................................
65

[2.2.68 goes
then](#then).................................................................................................................................................................
65

[2.2.69 goes
toggle](#toggle)..............................................................................................................................................................
66

[2.2.70 goes
true](#true)..................................................................................................................................................................
67

[2.2.71 goes
umount](#umount)...........................................................................................................................................................
67

[2.2.72 goes
uninstall](#uninstall)..........................................................................................................................................................
68

[2.2.73 goes
upgrade](#upgrade)..........................................................................................................................................................
68

[2.2.74 goes
uptimed](#uptimed)...........................................................................................................................................................
69

[2.2.75 goes
vnet](#vnet)..................................................................................................................................................................
70

[2.2.75.1 goes vnet show
event-log](#VnetEventLog)............................................................................................................................
70

[2.2.75.2 goes vnet show
buffers](#VnetShowBuffers)...............................................................................................................................
71

[2.2.75.3 goes vnet show
errors](#VnetShowErrors)..............................................................................................................................\...
71

[2.2.75.4 goes vnet show fe1
adj](#VnetShowFe1Adj)................................................................................................................................
72

[2.2.75.5 goes vnet show fe1
debug-events](#VnetShowFe1DebugEvents)...............................................................................................................
73

[2.2.75.6 goes vnet show fe1
eye-summary](#VnetShowFe1EyeSummary)...............................................................................................................
73

[2.2.75.7 goes vnet show fe1
eyescan](#VnetShowFe1EyeScan)........................................................................................................................
74

[2.2.75.8 goes vnet show fe1
interrupt](#VnetShowFe1Interrupt)......................................................................................................................
75

[2.2.75.9 goes vnet show fe1
l2](#VnetShowFe1L2)..................................................................................................................................
76

[2.2.75.10 goes vnet show fe1
temperature](#VnetShowFe1Temperature)..............................................................................................................
76

[2.2.75.11 goes vnet show fe1
switches](#VnetShowFe1Switches).....................................................................................................................
77

[2.2.75.12 goes vnet show fe1 phy
event-log](#VnetShowFe1PhyEventLog).............................................................................................................
77

[2.2.75.13 goes vnet show fe1
pipe-counters](#VnetShowFe1PipeCounters).............................................................................................................
78

[2.2.75.14 goes vnet show fe1 port-status
mac](#VnetShowFe1PortStatusMac)..........................................................................................................
80

[2.2.75.15 goes vnet show fe1 port-status
phy](#VnetShowFe1PortStatusPhy)...........................................................................................................
80

[2.2.75.16 goes vnet show fe1
serdes-param](#VnetShowFe1SerdesParam).............................................................................................................
83

[2.2.75.17 goes vnet show fe1
l3-interface](#VnetShowFe1L3Interface)................................................................................................................
85

[2.2.75.18 goes vnet show fe1
port-map](#VnetShowFe1PortMap)...................................................................................................................
89

[2.2.75.19 goes vnet show fe1
port-table](#VnetShowFe1PortTable)..................................................................................................................
91

[2.2.75.20 goes vnet show fe1
prefix-pool](#VnetShowFe1PrefixPool)................................................................................................................
91

[2.2.75.21 goes vnet show fe1
station-tcam](#VnetShowFe1StationTcam)..............................................................................................................
96

[2.2.75.22 goes vnet show fe1
tcam](#VnetShowFe1Tcam)..........................................................................................................................
98

[2.2.75.23 goes vnet show fe1
tx-pipe-buffer](#VnetShowFe1TxPipeBuffer)............................................................................................................
100

[2.2.75.24 goes vnet show fe1
visibility](#VnetShowFe1Visibility).....................................................................................................................
101

[2.2.75.25 goes vnet show fe1
vlan](#VnetShowFe1Vlan)...........................................................................................................................
102

[2.2.75.26 goes vnet show
hardware-interfaces](#VnetShowHardwareInterfaces).......................................................................................................
103

[2.2.75.27 goes vnet show
interfaces](#VnetShowInterfaces).......................................................................................................................
105

[2.2.75.28 goes vnet show ip
fib](#VnetShowIpFib)...............................................................................................................................
106

[2.2.75.29 goes vnet show netlink
namespaces](#VnetShowNetlinkNamespaces).......................................................................................................
108

[2.2.75.30 goes vnet show netlink
summary](#VnetShowNetlinkSummary)............................................................................................................
110

[2.2.75.31 goes vnet show
runtime](#VnetShowRuntime)..........................................................................................................................
110

[2.2.75.32 goes vnet show
packet-generator](#VnetShowPacketGenerator)...........................................................................................................
111

[2.2.75.33 goes vnet clear
errors](#VnetClearErrors)..............................................................................................................................
112

[2.2.75.34 goes vnet clear
event-log](#VnetClearEventLog)........................................................................................................................
112

[2.2.75.35 goes vnet clear fe1
interrupt](#VnetClearFe1Interrupt)...................................................................................................................
113

[2.2.75.36 goes vnet clear fe1
pipe-counters](#VnetClearFe1PipeCounters)...........................................................................................................
113

[2.2.75.37 goes vnet clear
interfaces](#VnetClearInterfaces).......................................................................................................................
114

[2.2.75.38 goes vnet clear ip
fib](#VnetClearIPFib)...............................................................................................................................
114

[2.2.75.39 goes vnet clear netlink
summary](#VnetClearNetlinkSummary).............................................................................................................
114

[2.2.75.40 goes vnet clear
runtime](#VnetClearRuntime)...........................................................................................................................
115

[2.2.75.41 goes vnet
event-log](#Vnet41EventLog).................................................................................................................................
115

[2.2.75.42 goes vnet
exec](#VnetExec).........................................................................................................................................
116

[2.2.75.43 goes vnet fe1 activate
mirror](#VnetFe1ActivateMirror)...................................................................................................................
116

[2.2.75.44 goes vnet fe1 deactivate
mirror](#VnetFe1DeactivateMirror)...............................................................................................................
117

[2.2.75.45 goes vnet fe1 delete
mirror](#VnetFe1DeleteMirror)......................................................................................................................
117

[2.2.75.46 goes vnet fe1 disable
sflow](#VnetFe1DisableSflow)......................................................................................................................
118

[2.2.75.47 goes vnet fe1 enable ingress
mirroring](#VnetFe1EnableIngressMirroring)....................................................................................................
118

[2.2.75.48 goes vnet fe1 enable
sflow](#VnetFe1EnableSflow).......................................................................................................................
119

[2.2.75.49 goes vnet fe1 get sflow
counters](#VnetFe1GetSflowCounters)..............................................................................................................
119

[2.2.75.50 goes vnet fe1 set mirror
encapsulation](#VnetFe1SetSflowMirrorEncapsulation)....................................................................................................
119

[2.2.75.51 goes vnet fe1 set sflow
default](#VnetFe1SetSflowDefault)................................................................................................................
120

[2.2.75.52 goes vnet fe1 set sflow
target](#VnetFe1SetSflowTarget)..................................................................................................................
120

[2.2.75.53 goes vnet fe1 show
mirror](#VnetFe1ShowMirror).......................................................................................................................
121

[2.2.75.54 goes vnet fe1 show sflow
details](#VnetFe1ShowSflowDetails)..............................................................................................................
121

[2.2.75.55 goes vnet i2c
scan](#VnetI2CScan).....................................................................................................................................
122

[2.2.75.56 goes vnet ip
interface](#VnetIPInterface)...............................................................................................................................
122

[2.2.75.57 goes vnet ip
route](#VnetIPRoute).....................................................................................................................................
123

[2.2.75.58 goes vnet netlink
log](#VnetNetlinkLog).................................................................................................................................
123

[2.2.75.59 goes vnet netlink
route](#VnetNetlinkRoute).............................................................................................................................
123

[2.2.75.60 goes vnet
packet-generator](#VnetPacketGenerator)......................................................................................................................
124

[2.2.75.61 goes vnet set fe1
l\_train\_restart](#Vnet61SetFe1TrainRestart)...............................................................................................................
124

[2.2.75.62 goes vnet set fe1
pmd\_restart](#Vnet62SetFe1PMDRestart)..................................................................................................................
125

[2.2.75.63 goes vnet set fe1
port-config](#VnetSetFe1PortConfig)....................................................................................................................
125

[2.2.75.64 goes vnet set fe1
reset\_port](#VnetSetFe1ResetPort).....................................................................................................................
126

[2.2.75.65 goes vnet set fe1
serdes-param](#VnetSetFe1SerdesParam)................................................................................................................
126

[2.2.75.66 goes vnet set
hardware-interface](#VnetSetHardwareInterfaces).............................................................................................................
127

[2.2.75.67 goes vnet set
interface](#VnetSetInterfaces)..............................................................................................................................
127

[2.2.76 goes
vnetd](#vnetd).............................................................................................................................................................
128

[2.2.77 goes
wget..............................................................................................................................................................
128](\l)

[Chapter-3 GoES-boot Commands](#_7fikqe1fta8y)

[Chapter-4 GoES BMC Commands](#_hppj21iolha8)

[**4.1 Redis \"hget\" Commands**](#BMCHGET)

[4.1.1
bmc.temperature.units.C](#BMC1Temperature)..................................................................................................................................
131

[4.1.2
cmdline.console](#BMC2CmdlineConsole)..................................................................................................................................................
131

[4.1.3
cmdline.init](#BMC3CmdlineInit)..........................................................................................................................................................
132

[4.1.4
cmdline.initrd](#BMC4CmdlineInitrd)......................................................................................................................................................
132

[4.1.5
cmdline.ip](#BMC5CmdlineIP).............................................................................................................................................................
133

[4.1.6
cmdline.mem](#BMC6CmdlineMem).......................................................................................................................................................
133

[4.1.7
cmdline.quiet](#BMC7CmdlineQuiet).......................................................................................................................................................
134

[4.1.8
cmdline.root](#BMC8CmdlineRoot)........................................................................................................................................................
134

[4.1.9
cmdline.rootfstype](#BMC9CmdlineRootfstype)..............................................................................................................................................
135

[4.1.10
cmdline.rootwait](#BMC10CmdlineRootwait).................................................................................................................................................
135

[4.1.11
cmdline.rw](#BMC11CmdlineRW)...........................................................................................................................................................
135

[4.1.12
cmdline.start](#BMC12CmdlineStart)........................................................................................................................................................
136

[4.1.13
eeprom.BaseEthernetAddress](#BMC13EEPROM)..........................................................................................................................
136

[4.1.14
eeprom.Crc](#BMC14EEPROMCRC)...........................................................................................................................................................
137

[4.1.15
eeprom.DeviceVersion](#BMC15EepromDeviceVersion).......................................................................................................................................
137

[4.1.16
eeprom.ManufactureDate](#BMC16EepromManufactureDate).................................................................................................................................
138

[4.1.17
eeprom.NEthernetAddress](#BMC17EepromNEthernetAddress)................................................................................................................................
138

[4.1.18
eeprom.Onie.Data](#BMC18EepromOnieData)...............................................................................................................................................
139

[4.1.19
eeprom.Onie.Version](#BMC19EepromOnieVersion)..........................................................................................................................................
139

[4.1.20
eeprom.PartNumber](#BMC20EepromPartNumber)...........................................................................................................................................
140

[4.1.21
eeprom.PlatformName](#BMC21EepromPlatformName).......................................................................................................................................
140

[4.1.22
eeprom.SerialNumber](#BMC22EepromSerialNumber)........................................................................................................................................
141

[4.1.23
eeprom.Vendor](#BMC23EepromVendor)....................................................................................................................................................
141

[4.1.24
eeprom.VendorExtension](\l)..................................................................................................................................
142

[4.1.25
fan\_tray.1.1.speed.units.rpm](#BMC25Fan_Tray1Speed)...........................................................................................................................
142

[4.1.26
fan\_tray.1.2.speed.units.rpm](#BMC26Fan_Tray2Speed)............................................................................................................................
143

[4.1.27
fan\_tray.1.status](#BMC27Fan_Tray1Status).................................................................................................................................................
143

[4.1.28
fan\_tray.2.1.speed.units.rpm](#BMC28Fan_Tray2Speed)...........................................................................................................................
144

[4.1.29
fan\_tray.2.2.speed.units.rpm](#BMC29Fan_Tray22Speed)............................................................................................................................
144

[4.1.30
fan\_tray.2.status](#BMC30Fan_Tray2Status)..................................................................................................................................................
145

[4.1.31
fan\_tray.3.1.speed.units.rpm](#BMC31Fan_Tray3SpeedUnits)...........................................................................................................................
145

[4.1.32
fan\_tray.3.2.speed.units.rpm](#BMC32Fan_Tray32SpeedUnits)............................................................................................................................
146

[4.1.33
fan\_tray.3.status](#BMC33Fan_Tray3Status)..................................................................................................................................................
146

[4.1.34
fan\_tray.4.1.speed.units.rpm](#BMC34Fan_Tray41SpeedUnits)............................................................................................................................
147

[4.1.35
fan\_tray.4.2.speed.units.rpm](#BMC35Fan_Tray42SpeedUnits).............................................................................................................................
147

[4.1.36
fan\_tray.4.status](#BMC36Fan_Tray4Status)..................................................................................................................................................
148

[4.1.37
fan\_tray.duty](#BMC37Fan_TrayDuty)........................................................................................................................................................
148

[4.1.38
fan\_tray.speed](#BMC38Fan_TraySpeed)......................................................................................................................................................
149

[4.1.39
host.temp.target.units.C](#BMC39HostTempTarget).....................................................................................................................................
149

[4.1.40
host.temp.units.C](#BMC40HostTempUnits).................................................................................................................................................
150

[4.1.41
hostname](#BMC41Hostname)...............................................................................................................................................................
150

[4.1.42
hwmon.front.temp.units.C](#BMC42HwmonFrontTemp).................................................................................................................................
151

[4.1.43
hwmon.rear.temp.units.C](#BMC43HwmonRearTemp)...................................................................................................................................
151

[4.1.44
hwmon.target.units.C](#BMC44HwmonTargetsUnits)..........................................................................................................................................
152

[4.1.45
machine](#BMC45Machine)..................................................................................................................................................................
152

[4.1.46
psu.powercycle](#BMC46PsuPowercycle).....................................................................................................................................................
153

[4.1.47
psu1.admin.state](#BMC47Psu1AdminState)..................................................................................................................................................
153

[4.1.48
psu1.eeprom](#BMC48Psu1Eeprom).........................................................................................................................................................
154

[4.1.49
psu1.fan\_direction](\l)...............................................................................................................................................
154

[4.1.50
psu1.fan\_speed.units.rpm](#BMC50Psu1FanSpeedUnits)..................................................................................................................................
155

[4.1.51
psu1.i\_out.units.A](#BMC51Psu1I_OutUnits)................................................................................................................................................
155

[4.1.52
psu1.mfg\_id](#BMC52Psu1Mfg_Id)..........................................................................................................................................................
156

[4.1.53
psu1.mfg\_model](#BMC53Psu1Mfg_Model)...................................................................................................................................................
156

[4.1.54
psu1.p\_in.units.W](#BMC54Psu1PInUnitsW).................................................................................................................................................
157

[4.1.55
psu1.p\_out.units.W](#BMC55Psu1POutUnitsW)..............................................................................................................................................
157

[4.1.56
psu1.sn](#BMC56Psu1Sn)...................................................................................................................................................................
158

[4.1.57
psu1.status](#BMC57Psu1Status)............................................................................................................................................................
158

[4.1.58
psu1.temp1.units.C](#BMC58Psu1Temp1Units)..............................................................................................................................................
159

[4.1.59
psu1.temp2.units.C](#BMC59Psu1Temp2Units)..............................................................................................................................................
159

[4.1.60
psu1.v\_in.units.V](#BMC60Psu1VInUnits)..................................................................................................................................................
160

[4.1.61
psu1.v\_out.units.V](#BMC61Psu1VOutUnits)...............................................................................................................................................
160

[4.1.62
psu2.admin.state](#BMC62Psu2AdminState)..................................................................................................................................................
161

[4.1.63
psu2.eeprom](#BMC63PSU2Eeprom).........................................................................................................................................................
161

[4.1.64
psu2.fan\_direction](#BMC64PSU2FanDirection)...............................................................................................................................................
162

[4.1.65
psu2.fan\_speed.units.rpm](#BMC65PSU2FanSpeedUnits)..................................................................................................................................
162

[4.1.66
psu2.i\_out.units.A](#BMC66PSU2IOutUnits)................................................................................................................................................
163

[4.1.67
psu2.mfg\_id](#BMC67PSU2MfgID)..........................................................................................................................................................
163

[4.1.68
psu2.mfg\_model](#BMC68PSU2MfgModel)..................................................................................................................................................
164

[4.1.69
psu2.p\_in.units.W](#BMC69PSU2PInUnits)................................................................................................................................................
164

[4.1.70
psu2.p\_out.units.W](#BMC70PSU2POutUnits).............................................................................................................................................
165

[4.1.71
psu2.sn](#BMC71PSU2Sn)..................................................................................................................................................................
165

[4.1.72
psu2.status](\l)...........................................................................................................................................................
166

[4.1.73
psu2.temp1.units.C](#BMC73PSU2Temp1Units).............................................................................................................................................
166

[4.1.74
psu2.temp2.units.C](#BMC74PSU2Temp2Units).............................................................................................................................................
167

[4.1.75
psu2.v\_in.units.V](#BMC75PSU2VIn).................................................................................................................................................
167

[4.1.76
psu2.v\_out.units.V](#BMC76PSU2VOutUnits)...............................................................................................................................................
168

[4.1.77
redis.ready](#BMC77RedisReady)............................................................................................................................................................
168

[4.1.78
sys.cpu.load1](#BMC78SysCpuLoad1)........................................................................................................................................................
169

[4.1.79
sys.cpu.load10](#BMC79SysCpuLoad10)......................................................................................................................................................
169

[4.1.80
sys.cpu.load15](#BMC80SysCpuLoad15)......................................................................................................................................................
170

[4.1.81
sys.mem.buffer](#BMC81SysMemBuffer)....................................................................................................................................................
170

[4.1.82
sys.mem.free](\l)........................................................................................................................................................
171

[4.1.83
sys.mem.shared](#BMC83SysMemShared)...................................................................................................................................................
171

[4.1.84
sys.mem.total](#BMC84SysMemTotal).......................................................................................................................................................
172

[4.1.85
sys.uptime](#BMC85SysUptime)............................................................................................................................................................
172

[4.1.86
system.fan\_direction](\l)..........................................................................................................................................
173

[4.1.87
vmon.1v0.tha.units.V](#BMC87Vmon1v0ThaUnits)..........................................................................................................................................
173

[4.1.88
vmon.1v0.thc.units.V](#BMC88Vmon1v0ThcUnits)..........................................................................................................................................
174

[4.1.89
vmon.1v2.ethx.units.V](#BMC89Vmon1v2EthxUnits)........................................................................................................................................
174

[4.1.90
vmon.1v25.sys.units.V](#BMC90Vmon1v25SysUnits)........................................................................................................................................
175

[4.1.91
vmon.1v8.sys.units.V](#BMC91Vmon1v8SysUnits)..........................................................................................................................................
175

[4.1.92
vmon.3v3.bmc.units.V](#BMC92Vmon3v3BmcUnits)........................................................................................................................................
176

[4.1.93
vmon.3v3.sb.units.V](#BMC93Vmon3v3SbUnits)............................................................................................................................................
176

[4.1.94
vmon.3v3.sys.units.V](#BMC94Vmon3v3SysUnits)..........................................................................................................................................
177

[4.1.95
vmon.3v8.bmc.units.V](#BMC95Vmon3v8BmcUnits)........................................................................................................................................
177

[4.1.96
vmon.5v.sb.units.V](#BMC96Vmon5vSbUnits)..............................................................................................................................................
178

[4.1.97
vmon.poweroff.events](#BMC97VmonPoweroffEvents)........................................................................................................................................
178

[**4.1 Redis \"hset\"
Commands**](#BMCHSET)..................................................................................................................................
179

Chapter 1

[]{#_mj05z6gmuigq .anchor}

Overview

 [ ]{.underline}

This document explains the commands to be used in Linux, coreboot & BMC
consoles respectively

Chapter 2

Linux Commands

[]{#_fv04ufbo5iar .anchor}

**2.1 GoES Commands**

[]{#GoesHelp .anchor}**2.1.1 goes help**

-   **Command:**

> root\@invader44:\~\$ sudo goes help

-   **Description:**

> Lists all the available command for goes. Currently it is not showing
> the actual commands like \"goes hget, goes vnet\" that can start with
> \"goes\" but instead it is showing \"goes COMMAND\"

-   **Examples**

> **sandeep\@invader44:\~\$ sudo goes help**
>
> \[sudo\] password for sandeep:
>
> usage: goes COMMAND \[ ARGS \]\...
>
> goes COMMAND -\[-\]HELPER \[ ARGS \]\...
>
> goes HELPER \[ COMMAND \] \[ ARGS \]\...
>
> goes \[ -d \] \[ -x \] \[\[ -f \]\[ - \| SCRIPT \]\]
>
> HELPER := { apropos \| complete \| help \| man \| usage }

[]{#GoesMan .anchor}**2.1.2 goes man**

-   **Command:**

> **root\@invader44:\~\$ goes man**

-   **Description:**

> **root\@invader44\# goes man**
>
> NAME
>
> goes-platina-mk1 - goes machine for platina\'s mk1 TOR
>
> SYNOPSIS
>
> goes COMMAND \[ ARGS \]\...
>
> goes COMMAND -\[-\]HELPER \[ ARGS \]\...
>
> goes HELPER \[ COMMAND \] \[ ARGS \]\...
>
> goes \[ -d \] \[ -x \] \[\[ -f \]\[ - \| SCRIPT \]\]
>
> HELPER := { apropos \| complete \| help \| man \| usage }
>
> OPTIONS
>
> -d debug block handling
>
> -x print command trace
>
> -f don\'t terminate script on error
>
> \- execute standard input script
>
> SCRIPT execute named script file
>
> SEE ALSO
>
> goes apropos \[COMMAND\], goes man COMMAND
>
> root\@invader44\#

[]{#GoesUsage .anchor}**2.1.3 goes usage**

-   **Command:**

> root\@invader44:\~\$ sudo goes help

-   **Description:**

> **root\@invader42:/home/jignesh\# goes usage**
>
> usage: goes COMMAND \[ ARGS \]\...
>
> goes COMMAND -\[-\]HELPER \[ ARGS \]\...
>
> goes HELPER \[ COMMAND \] \[ ARGS \]\...
>
> goes \[ -d \] \[ -x \] \[\[ -f \]\[ - \| SCRIPT \]\]
>
> HELPER := { apropos \| complete \| help \| man \| usage }
>
> root\@invader42:/home/jignesh\#
>
> root\@invader42:/home/jignesh\#

[]{#GOESapropos .anchor}**2.2 goes apropos**

-   **Command:**

> **root\@invader44:\~\$ goes apropos**

-   **Description:**

> ! run an external command
>
> /init bootstrap
>
> \[ test conditions and set exit status
>
> bootc bootc provides wipe and access to bootc.cfg.
>
> bootd http boot controller daemon
>
> cat
>
> DESCRIPTION
>
> Concatenate FILE(s), or standard input, to standard output.
>
> With no FILE, or when FILE is -, read standard input.
>
> EXAMPLES
>
> cat f - g
>
> Output f\'s contents, then standard input, then g\'s contents.

-   **Examples:**

> ! run an external command
>
> /init bootstrap
>
> \[ test conditions and set exit status
>
> bootc bootc provides wipe and access to bootc.cfg.
>
> bootd http boot controller daemon
>
> cat
>
> DESCRIPTION
>
> Concatenate FILE(s), or standard input, to standard output.
>
> With no FILE, or when FILE is -, read standard input.
>
> EXAMPLES
>
> cat f - g
>
> Output f\'s contents, then standard input, then g\'s contents.
>
> cat
>
> Copy standard input to standard output.
>
> cd change the current directory
>
> chmod change file mode
>
> cli command line interpreter
>
> cp copy files and directories
>
> dmesg print or control the kernel ring buffer
>
> echo print a line of text
>
> eeprom show, delete or modify eeprom fields
>
> else if COMMAND ; then COMMAND else COMMAND endelse
>
> env run a program in a modified environment
>
> exec execute a file
>
> exit exit the shell
>
> export set process configuration
>
> false Fail regardless of our ability
>
> femtocom tiny serial-terminal emulation
>
> fi end of if command block
>
> function function name { definition }
>
> goes-daemons start daemons and wait for their exit
>
> gpio manipulate GPIO pins
>
> hdel delete one or more redis hash fields
>
> hdelta print the changed fields of a redis hash
>
> hexists determine if the redis hash field exists
>
> hget get the value of a redis hash field
>
> hgetall get all the field values in a redis hash
>
> hkeys get all the fields in a redis hash
>
> hset set the string value of a redis hash field
>
> hwait wait until the redis hash field has given value
>
> if conditional command
>
> insmod insert a module into the Linux Kernel
>
> install install this goes machine
>
> io read/write the CPU\'s I/O ports
>
> ip show / manipulate routing, etc.
>
> kexec load a new kernel for later execution
>
> keys find all redis keys matching the given pattern
>
> kill signal a process
>
> ln make links between files
>
> log print text to /dev/kmsg
>
> ls list directory contents
>
> lsmod print status of Linux Kernel modules
>
> mkdir make directories
>
> mknod make block or character special files
>
> mount activated a filesystem
>
> ping send ICMP ECHO\_REQUEST to network host
>
> ps print process state
>
> pwd print working directory
>
> qsfp qsfp monitoring daemon, publishes to redis
>
> reboot reboot system
>
> redisd a redis server
>
> reload SIGHUP this goes machine
>
> restart stop, then start this goes machine
>
> rm remove files or directories
>
> rmmod remove a module from the Linux Kernel
>
> show print stuff
>
> sleep suspend execution for an interval of time
>
> source import command script
>
> start start this goes machine
>
> status print status of goes daemons
>
> stop stop this goes machine
>
> stty print info for given or current TTY
>
> subscribe print messages published to given redis channel
>
> sync flush file system buffers
>
> tempd temperature monitoring daemon, publishes to redis
>
> then conditionally execute commands
>
> toggle toggle console port between x86 and BMC
>
> true Be successful not matter what
>
> umount deactivate filesystems
>
> uninstall uninstall this goes machine
>
> upgrade upgrade images
>
> uptimed record system uptime in redis
>
> vnet send commands to hidden cli
>
> vnetd FIXME
>
> wget a non-interactive network downloader

[]{#goes1 .anchor}**2.2.1 goes !**

-   **Command:**

> **root\@invader44:\~\$ goes !**

-   **Description:**

> Run an external command.
>
> **\[root\@invader44:\~\# goes ! help**
>
> usage: ! COMMAND \[ARGS\]\... \[&\]
>
> root\@invader45:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes !**

[]{#init .anchor}**2.2.2 goes /init**

-   **Command:**

> **root\@invader44:\~\$ goes /init**

-   **Description:**

> Bootstrap command.
>
> **\[root\@invader45:\~\# goes /init**
>
> init \[OPTIONS\...\] {COMMAND}
>
> Send control commands to the init daemon.
>
> \--help Show this help
>
> \--no-wall Don\'t send wall message before halt/power-off/reboot
>
> Commands:
>
> 0 Power-off the machine
>
> 6 Reboot the machine
>
> 2, 3, 4, 5 Start runlevelX.target unit
>
> 1, s, S Enter rescue mode
>
> q, Q Reload init daemon configuration
>
> u, U Reexecute init daemon
>
> root\@invader45:\~\#**\]**

-   **Examples:**

    **root\@invader44:\~\# goes /init 6**

[]{#goes2 .anchor}**2.2.3 goes \[**

-   **Command:**

> **root\@invader44:\~\$ goes \[**

-   **Description:**

> Test conditions and set exit status.
>
> **\[root\@invader44:\~\# goes \[ help**
>
> \[: missing \]
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes \[**

[]{#bootc .anchor}**2.2.4 goes bootc**

-   **Command:**

> **root\@invader44:\~\$ goes bootc**

-   **Description:**

> Bootc provides wipe and access to bootc.cfg.
>
> **\[root\@invader44:\~\# goes bootc help**
>
> usage: bootc \[register\] \[bootc\] \[dumpvars\] \[dashboard\]
> \[initcfg\]
>
> \[wipe\]
>
> \[getnumclients\] \[getclientdata\] \[getscript\] \[getbinary\]
>
> \[testscript\]
>
> \[test404\] \[dashboard9\] \[setsda6\] \[clrsda6\] \[setinstall\]
>
> \[clrinstall\]
>
> \[setsda1\] \[clrsda1\] \[readcfg\] \[setip\] \[setnetmask\]
>
> \[setgateway\]
>
> \[setkernel\] \[setinitrd\] \[getclientbootdata\] \[setpost\]
>
> root\@invader45:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes bootc**

[]{#bootd .anchor}**2.2.5 goes bootd**

-   **Command:**

> **root\@invader44:\~\$ goes bootd**

-   **Description:**

> http-boot controller daemon.
>
> **\[root\@invader44:\~\# goes bootd help**
>
> usage: bootd
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes bootd**

[]{#cat .anchor}**2.2.6 goes cat **

-   **Command:**

> **root\@invader44:\~\$ goes cat**

-   **Description:**

> Concatenate FILE(s), or standard input, to standard output.
>
> With no FILE, or when FILE is -, read standard input..
>
> **\[root\@invader44:\~\# goes cat help**
>
> usage: cat \[FILE\]\...
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> root\@invader44:\~\$ goes ls
>
> .bash\_history .bashrc .ssh
>
> .bash\_logout .profile
>
> **root\@invader44:\~\$ goes cat** .profile
>
> \# \~/.profile: executed by the command interpreter for login shells.
>
> \# This file is not read by bash(1), if \~/.bash\_profile or
> \~/.bash\_login
>
> \# exists.
>
> \# see /usr/share/doc/bash/examples/startup-files for examples.
>
> \# the files are located in the bash-doc package.
>
> \# the default umask is set in /etc/profile; for setting the umask
>
> \# for ssh logins, install and configure the libpam-umask package.
>
> \#umask 022
>
> \# if running bash
>
> if \[ -n \"\$BASH\_VERSION\" \]; then
>
> \# include .bashrc if it exists
>
> if \[ -f \"\$HOME/.bashrc\" \]; then
>
> . \"\$HOME/.bashrc\"
>
> fi
>
> fi
>
> \# set PATH so it includes user\'s private bin if it exists
>
> if \[ -d \"\$HOME/bin\" \] ; then
>
> PATH=\"\$HOME/bin:\$PATH\"
>
> fi
>
> rohan\@invader44:\~\$

[]{#cd .anchor}

**2.2.7 goes cd**

-   **Command:**

> **root\@invader44:\~\$ goes cd**

-   **Description:**

> Changes the current directory. (to the directory mentioned)
>
> **\[root\@invader44:\~\# goes cd help**
>
> usage: cd \[- \| DIRECTORY\]
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes cd**
>
> **(not working)**

[]{#chmod .anchor}**2.2.8 goes chmod**

-   **Command:**

> **root\@invader44:\~\$ goes chmod**

-   **Description:**

> Allows to change the file mode/permission.
>
> There are different mode-file options available
>
> chmod 600 file-- owner can read and write
>
> chmod 700 file-- owner can read, write and execute
>
> chmod 666 file-- all can read and write
>
> chmod 777 file-- all can read, write and execute
>
> **\[root\@invader44:/\# goes chmod help**
>
> usage: chmod MODE FILE\...
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> root\@invader44:/etc\# ls --la
>
> \--w-rwxr\-- 1 root root 585 Jul 20 04:28 subuid
>
> **root\@invader44:/etc\# goes chmod 777 subuid**
>
> root\@invader44:/etc\# ls --la
>
> -r\-\-\--x\--x 1 root root 585 Jul 20 04:28 subuid

**2.2.9 goes cli**

-   **Command:**

> **root\@invader44:\~\$ goes cli**

-   **Description:**

> Changes to Command Line Interpreter.
>
> **\[root\@invader44:\~\# goes cli help**
>
> usage: cli \[-x\] \[-p PROMPT\] \[URL\]
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes cli**
>
> **invader44\>**

[]{#cp .anchor}**2.2.10 goes cp**

-   **Command:**

> **root\@invader44:\~\$ goes cp**

-   **Description:**

> Copy files and directories .There are different options which can be
> used with this command, which include
>
> 1\) Treat'destination'as a normal file.
>
> 2\) Copy all source arguments into the directory
>
> 3\) Making a copy of a file in the same directory.
>
> **\[root\@invader44:\~\# goes cp help**
>
> usage: cp \[-v\] -T SOURCE DESTINATION
>
> cp \[-v\] -t DIRECTORY SOURCE\...
>
> cp \[-v\] SOURCE\... DIRECTORY
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> root\@invader44:\~\# ls
>
> testfile.txt
>
> **root\@invader44:\~\# goes cp testfile.txt testfile55.txt**
>
> root\@invader44:\~\# ls
>
> testfile.txt testfile55.txt

[]{#dmesg .anchor}**2.2.11 goes dmesg**

-   **Command:**

> **root\@invader44:\~\$ goes dmesg**

-   **Description:**

> Print or control the kernel ring buffer.
>
> There are different options for this command:

1.  goes dmesg -C,\--clear :- Clears the ring buffer.

2.  goes dmesg -c,\--read-clear :- Clears the ring buffer after
    printing.

3.  goes dmesg --D,\--console-off :- Disable printing messages to the
    console.

4.  goes dmesg --E,\--console-on :- Enable Printing messages to the
    console

5.  goes dmesg --d,\--show-delta :- Display the time-stamp and
    time-delta spent between the messages.

6.  goes dmesg --f,\--facility list :- Restricts output to defined
    (comma-seperated) list of facilities.

7.  goes dmesg --k,\--kernel :- Print Kernel messages.

8.  goes dmesg --r,\--raw :- Print the law level buffer, i.e. don't skip
    the log-level-prefixes.

9.  goes dmesg --t,\--notime :- Don't print kernel time-stamps.

10. goes dmesg --u,\--userspace :- Print Userspace messages.

11. goes dmesg --V,\--version :- Output version Information and exit.

> **\[root\@invader44:\~\# goes dmesg help**
>
> usage: dmesg \[OPTION\]\...
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader45:\~\# goes dmesg **
>
> \[0000000.000002\] Calibrating delay loop (skipped), value calculated
> using timer frequency.. 4390.10 BogoMIPS (lpj=8780208)
>
> \[0000000.004000\] pid\_max: default: 32768 minimum: 301
>
> \[0000000.004000\] ACPI: Core revision 20170531
>
> \[0000000.004000\] ACPI: 2 ACPI AML tables successfully acquired and
> loaded
>
> \[0000000.004000\] Mount-cache hash table entries: 32768 (order: 6,
> 262144 bytes)
>
> \[0000000.004000\] Mountpoint-cache hash table entries: 32768 (order:
> 6, 262144 by tes)
>
> \[0000000.004000\] CPU: Physical Processor ID: 0
>
> \[0000000.004000\] CPU: Processor Core ID: 0
>
> \[0000000.004000\] mce: CPU supports 22 MCE banks
>
> \[0000000.004000\] CPU0: Thermal monitoring enabled (TM1)
>
> \[0000000.004000\] process: using mwait in idle threads
>
> \[0000000.004000\] Last level iTLB entries: 4KB 64, 2MB 8, 4MB 8
>
> \[0000000.004000\] Last level dTLB entries: 4KB 64, 2MB 0, 4MB 0, 1GB
> 4
>
> \[0000000.004000\] Freeing SMP alternatives memory: 24K
>
> \[0000000.004000\] smpboot: Max logical packages: 2
>
> \[0000000.004000\] DMAR: Host address width 46
>
> \[0000000.004000\] DMAR: DRHD base: 0x000000fbffc000 flags: 0x1
>
> \[0000000.004000\] DMAR: dmar0: reg\_base\_addr fbffc000 ver 1:0 cap
> 8d2078c106f0466 ecap f020df
>
> \....
>
> \....
>
> \[0237606.347447\] IPv6: ADDRCONF(NETDEV\_UP): eth-1-1: link is not
> ready
>
> \[0240352.324668\] docker0: port 1(veth772b426) entered blocking state
>
> \[0240352.329847\] docker0: port 1(veth772b426) entered disabled state
>
> \[0240352.335051\] device veth772b426 entered promiscuous mode
>
> \[0240352.339547\] IPv6: ADDRCONF(NETDEV\_UP): veth772b426: link is
> not ready
>
> \[0240352.522042\] eth0: renamed from veth15c6df9
>
> \[0240352.554127\] IPv6: ADDRCONF(NETDEV\_CHANGE): veth772b426: link
> becomes ready
>
> \[0240352.560444\] docker0: port 1(veth772b426) entered blocking state
>
> \[0240352.565607\] docker0: port 1(veth772b426) entered forwarding
> state
>
> root\@invader45:\~\#

[]{#echo .anchor}**2.2.12 goes echo**

-   **Command:**

> **root\@invader44:\~\$ goes echo**

-   **Description:**

> Print a line of text
>
> **\[root\@invader44:\~\# goes echo help**
>
> usage: echo \[-n\] \[STRING\]\...
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes echo \"**Platina Systems**\"**
>
> Platina Systems
>
> **root\@invader44:\~\# goes echo -x \"**Platina Systems**\"**
>
> Platina Systems Platina Systems
>
> **root\@invader44:\~\# goes echo -n** \"Platina Systems\"
>
> Platina Systems**root\@invader45:\~\#**
>
> **root\@invader44:\~\#**

[]{#eeprom .anchor}**2.2.13 goes eeprom**

-   **Command:**

> **root\@invader44:\~\$ goes eeprom**

-   **Description:**

> Show, delete or modify eeprom fields.
>
> **\[root\@invader44:\~\# goes eeprom help**
>
> usage: eeprom \[-n\] \[-FIELD \| FIELD=VALUE\]\...
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes eeprom **

[]{#else .anchor}**2.2.14 goes else**

-   **Command:**

> **root\@invader44:\~\$ goes else**

-   **Description:**

> if COMMAND ; then COMMAND else COMMAND endelse.
>
> **\[root\@invader44:\~\# goes else help**
>
> usage: else COMMAND
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes else **

[]{#env .anchor}**2.2.15 goes env**

-   **Command:**

> **root\@invader44:\~\$ goes env**

-   **Description:**

> Run a program in a modified environment.
>
> **\[root\@invader44:\~\# goes env help**
>
> usage: env \[NAME\[=VALUE\... COMMAND \[ARGS\...\]\]\]
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes env**

[]{#exec .anchor}**2.2.16 goes exec**

-   **Command:**

> **root\@invader44:\~\$ goes exec**

-   **Description:**

> Execute a file.
>
> **\[root\@invader44:\~\# goes exec help**
>
> usage: exec COMMAND\...
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes exec**

[]{#exit .anchor}**2.2.17 goes exit**

-   **Command:**

> **root\@invader44:\~\$ goes exit**

-   **Description:**

> Used to exit the shell.
>
> **\[root\@invader44:\~\# goes exit help**
>
> usage: exit \[N\]
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes exit**

[]{#export .anchor}**2.2.18 goes export**

-   **Command:**

> **root\@invader44:\~\$ goes export**

-   **Description:**

> Sets the process configuration.
>
> **\[root\@invader44:\~\# goes export help**
>
> usage: export \[NAME\[=VALUE\]\]\...
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes export**

[]{#false .anchor}**2.2.19 goes false**

-   **Command:**

> **root\@invader44:\~\$ goes false**

-   **Description:**

> Fails regardless of our ability.
>
> **\[root\@invader44:\~\# goes false help**
>
> usage: false
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes false**

[]{#femtocom .anchor}**2.2.20 goes femtocom**

-   **Command:**

> **root\@invader44:\~\$ goes femtocom**

-   **Description:**

> Tiny serial-terminal emulation.
>
> **\[root\@invader44:\~\# goes femtocom help**
>
> usage: femtocom \[OPTION\]\... DEVICE
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes femtocom**

[]{#fi .anchor}**2.2.21 goes fi**

-   **Command:**

> **root\@invader44:\~\$ goes fi help**

-   **Description:**

> End of if command block.
>
> **\[root\@invader44:\~\# goes fi help**
>
> usage: fi
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes fi**

[]{#function .anchor}**2.2.22 goes function**

-   **Command:**

> **root\@invader44:\~\$ goes function**

-   **Description:**

> Function name { definition }
>
> **\[root\@invader44:\~\# goes function help**
>
> usage: function name { definition }
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes function**

[]{#goesdaemons .anchor}**2.2.23 goes goes-daemons**

-   **Command:**

> **root\@invader44:\~\$ goes goes-daemons**

-   **Description:**

> Start daemons and wait for their exit.
>
> **\[root\@invader44:\~\# goes goes-daemons help**
>
> usage: goes-daemons \[OPTIONS\]\...
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes goes-daemons**

[]{#gpio .anchor}**2.2.24 goes gpio**

-   **Command:**

> **root\@invader44:\~\$ goes gpio**

-   **Description:**

> Manipulate GPIO pins.
>
> **\[root\@invader44:\~\# goes gpio help**
>
> usage: gpio PIN\_NAME \[VALUE\]
>
> root\@invader4:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes gpio**

[]{#hdel .anchor}**2.2.25 goes hdel**

-   **Command:**

> **root\@invader44:\~\$ goes hdel**

-   **Description:**

> Delete one or more redis hash fields.
>
> **\[root\@invader44:\~\# goes hdel help**
>
> usage: hdel KEY FIELD
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes hdel**

[]{#hdelta .anchor}**2.2.26 goes hdelta**

-   **Command:**

> **root\@invader44:\~\$ goes hdelta**

-   **Description:**

> Print the changed fields of a redis hash.
>
> **\[root\@invader44:\~\# goes hdelta help**
>
> usage: hdelta \[CHANNEL\]
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes hdelta**

[]{#hexists .anchor}**2.2.27 goes hexists**

-   **Command:**

> **root\@invader44:\~\$ goes hexists**

-   **Description:**

> Determine if the redis hash field exists.
>
> **\[root\@invader44:\~\# goes hexists help**
>
> usage: hexists KEY FIELD
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes hexists**

[]{#hget .anchor}**2.2.28 goes hget**

-   **Command:**

> **root\@invader44:\~\$ goes hget**

-   **Description:**

> Get the value of a redis hash field.
>
> **\[root\@invader44:\~\# goes hget help**
>
> usage: hget KEY FIELD
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes hget**

[]{#hgetall .anchor}**2.2.29 goes hgetall**

-   **Command:**

> **root\@invader44:\~\$ goes hgetall**

-   **Description:**

> Get all the field value of a redis hash.
>
> **\[root\@invader44:\~\# goes hgetall help**
>
> usage: hgetall \[KEY\]
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes hgetall**

[]{#hkeys .anchor}**2.2.30 goes hkeys**

-   **Command:**

> **root\@invader44:\~\$ goes hkeys**

-   **Description:**

> Get all the fields in a redis hash.
>
> **\[root\@invader44:\~\# goes hkeys help**
>
> usage: hkeys KEY
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes hkeys**

[]{#hset .anchor}**2.2.31 goes hset**

-   **Command:**

> **root\@invader44:\~\$ goes hset**

-   **Description:**

> Set the string value of a redis hash field.
>
> **\[root\@invader44:\~\# goes hset help**
>
> usage: hset \[-q\] KEY FIELD VALUE
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes hset**

[]{#hwait .anchor}**2.2.32 goes hwait**

-   **Command:**

> **root\@invader44:\~\$ goes hwait**

-   **Description:**

> Waits until the redis hash field has given value.
>
> **\[root\@invader44:\~\# goes hwait help**
>
> usage: hwait KEY FIELD VALUE \[TIMEOUT(seconds)\]
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes hwait**

[]{#if .anchor}**2.2.33 goes if**

-   **Command:**

> **root\@invader44:\~\$ goes if**

-   **Description:**

> Conditional command.
>
> **\[root\@invader44:\~\# goes if help**
>
> usage: if COMMAND ; then COMMAND else COMMAND endif
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes if**

[]{#insmod .anchor}**2.2.34 goes insmod**

-   **Command:**

> **root\@invader44:\~\$ goes insmod**

-   **Description:**

> Insert a module into the Linux Kernel.
>
> **\[root\@invader44:\~\# goes insmod help**
>
> usage: insmod \[OPTION\]\... FILE \[NAME\[=VAL\[,VAL\]\]\]\...
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes insmod**

[]{#install .anchor}**2.2.35 goes install**

-   **Command:**

> **root\@invader44:\~\$ goes install**

-   **Description:**

> Install this goes machine.
>
> **\[root\@invader44:\~\# goes install help**
>
> usage: install \[START, STOP and REDISD options\]\...
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes install**

[]{#io .anchor}**2.2.36 goes io**

-   **Command:**

> **root\@invader44:\~\$ goes io**

-   **Description:**

> Read/write the CPU\'s I/O ports.
>
> **\[root\@invader44:\~\# goes io help**
>
> usage: io \[\[-r\] \| -w\] IO-ADDRESS \[-D DATA\] \[-m MODE\]
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes io**

[]{#ip .anchor}**2.2.37 goes ip**

-   **Command:**

> **root\@invader44:\~\$ goes ip**

-   **Description:**

> Show / manipulate routing, IP information etc..
>
> **\[root\@invader44:\~\# goes ip help**
>
> usage: ip \[ NETNS \] OBJECT \[ COMMAND \[ FAMILY \] \[ OPTIONS \]\...
> \[
>
> ARG \]\... \]
>
> ip \[ NETNS \] -batch \[ -x \| -f \] \[ - \| FILE \]
>
> NETNS := { -a\[ll\] \| -n\[etns\] NAME }
>
> OBJECT := { address \| fou \| link \| monitor \| neighbor \| netns \|
>
> route }
>
> FAMILY := { -f\[amily\] { inet \| inet6 \| mpls \| bridge \| link } \|
>
> { -4 \| -6 \| -B \| -0 } }
>
> OPTION := { -s\[tat\[isti\]cs\] \| -d\[etails\] \| -r\[esolve\] \|
>
> -human\[-readable\] \| -iec \|
>
> -l\[oops\] { maximum-addr-flush-attempts } \| -br\[ief\] \|
>
> -o\[neline\] \| -t\[imestamp\] \| -ts\[hort\] \|
>
> -rc\[vbuf\] \[size\] \| -c\[olor\] }
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes ip**

[]{#kexec .anchor}**2.2.38 goes kexec**

-   **Command:**

> **root\@invader44:\~\$ goes kexec**

-   **Description:**

> Load a new kernel for later execution.
>
> **\[root\@invader44:\~\# goes kexec help**
>
> usage: kexec \[OPTIONS\]\...
>
> root\@invader45:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes kexec**

[]{#keys .anchor}**2.2.39 goes keys**

-   **Command:**

> **root\@invader44:\~\$ goes keys**

-   **Description:**

> Find all redis keys matching the given pattern.
>
> **\[root\@invader44:\~\# goes keys help**
>
> usage: keys \[PATTERN\]
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes keys**

[]{#kill .anchor}**2.2.40 goes kill**

-   **Command:**

> **root\@invader44:\~\$ goes kill**

-   **Description:**

> Signal a process.
>
> **\[root\@invader44:\~\# goes kill help**
>
> usage: kill \[OPTION\] \[PID\]\...
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes kill**

[]{#ln .anchor}**2.2.41 goes ln**

-   **Command:**

> **root\@invader44:\~\$ goes ln**

-   **Description:**

> Make links between files.
>
> **\[root\@invader44:\~\# goes ln help**
>
> usage: ln \[OPTION\]\... -t DIRECTORY TARGET\...
>
> ln \[OPTION\]\... -T TARGET LINK
>
> ln \[OPTION\]\... TARGET LINK
>
> ln \[OPTION\]\... TARGET\... DIRECTORY
>
> ln \[OPTION\]\... TARGET
>
> root\@invader45:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes ln**

[]{#log .anchor}**2.2.42 goes log**

-   **Command:**

> **root\@invader44:\~\$ goes log **

-   **Description:**

> Print text to /dev/kmsg.
>
> **\[root\@invader44:\~\# goes log help**
>
> usage: log \[PRIORITY \[FACILITY\]\] TEXT\...
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes log**

[]{#ls .anchor}**2.2.43 goes ls**

-   **Command:**

> **root\@invader44:\~\$ goes ls**

-   **Description:**

> List directory contents.
>
> **\[root\@invader44:\~\# goes ls help**
>
> usage: ls \[OPTION\]\... \[FILE\]\...
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes ls**
>
> container\_testcase\_single\_vlan
>
> goes-platina-mk1-installer
>
> goesd-platina-mk1-modprobe.conf
>
> goesd-platina-mk1-modules.conf
>
> goesd-platina-mk1-sysctl.conf
>
> .ansible .profile coreboot-platina-mk1.rom
>
> .bash\_history .ssh test1
>
> .bashrc .vimrc tools
>
> .history\_quagga cb.rom volumes
>
> root\@invader44:\~\#

[]{#lsmod .anchor}**2.2.44 goes lsmod**

-   **Command:**

> **root\@invader44:\~\$ goes lsmod**

-   **Description:**

> Print status of Linux Kernel modules.
>
> **\[root\@invader44:\~\# goes lsmod help**
>
> usage: lsmod
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes lsmod**
>
> Module Size Used by
>
> platina\_mk1 53248 0
>
> 8021q 24576 0
>
> ipt\_MASQUERADE 16384 1
>
> nf\_nat\_masquerade\_ipv4 16384 1 ipt\_MASQUERADE
>
> nf\_conntrack\_netlink 28672 0
>
> nfnetlink 16384 2 nf\_conntrack\_netlink
>
> iptable\_nat 16384 1
>
> nf\_conntrack\_ipv4 16384 3
>
> nf\_defrag\_ipv4 16384 1 nf\_conntrack\_ipv4
>
> nf\_nat\_ipv4 16384 1 iptable\_nat
>
> xt\_addrtype 16384 2
>
> iptable\_filter 16384 1
>
> xt\_conntrack 16384 1
>
> nf\_nat 24576 2 nf\_nat\_masquerade\_ipv4,nf\_nat\_ipv4
>
> nf\_conntrack 73728 7
> ipt\_MASQUERADE,nf\_nat\_masquerade\_ipv4,nf\_conntrack\_netlink,nf\_conntrack\_ipv4,nf\_nat\_ipv4,xt\_conntrack,nf\_nat
>
> br\_netfilter 24576 0
>
> bridge 110592 1 br\_netfilter
>
> stp 16384 1 bridge
>
> llc 16384 2 bridge,stp
>
> overlay 57344 0
>
> kvm\_intel 184320 0
>
> kvm 344064 1 kvm\_intel
>
> iTCO\_wdt 16384 1
>
> iTCO\_vendor\_support 16384 1 iTCO\_wdt
>
> ixgbevf 57344 0
>
> autofs4 36864 0
>
> i2c\_i801 24576 0
>
> ixgbe 249856 0
>
> mdio 16384 1 ixgbe
>
> root\@invader44:\~\#

[]{#mkdir .anchor}

**2.2.45 goes mkdir**

-   **Command:**

> **root\@invader44:\~\$ goes mkdir**

-   **Description:**

> Make directories.
>
> **\[root\@invader44:\~\# goes mkdir help**
>
> usage: mkdir \[OPTION\]\... DIRECTORY\...
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> []{#mknod .anchor}**root\@invader44:\~\# ls**
>
> cb.rom goesd-platina-mk1-modprobe.conf goes-platina-mk1-installer
>
> container\_testcase\_single\_vlan goesd-platina-mk1-modules.conf tools
>
> coreboot-platina-mk1.rom goesd-platina-mk1-sysctl.conf volumes
>
> **root\@invader44:\~\# goes mkdir test1**
>
> **root\@invader44:\~\#**
>
> **root\@invader44:\~\# ls**
>
> cb.rom goesd-platina-mk1-modules.conf tools
>
> container\_testcase\_single\_vlan goesd-platina-mk1-sysctl.conf
> volumes
>
> coreboot-platina-mk1.rom goes-platina-mk1-installer
>
> goesd-platina-mk1-modprobe.conf **test1**
>
> **root\@invader44:\~\#**

**2.2.46 goes mknod**

-   **Command:**

> **root\@invader44:\~\$ goes mknod**

-   **Description:**

> Make block or character special files.
>
> **\[root\@invader44:\~\# goes mknod help**
>
> usage: mknod \[OPTION\]\... NAME TYPE \[MAJOR MINOR\]
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes mknod**

[]{#mount .anchor}**2.2.47 goes mount**

-   **Command:**

> **root\@invader44:\~\$ goes mount**

-   **Description:**

> Activate a file-system.
>
> **\[root\@invader44:\~\# goes mount help**
>
> usage: usage \[OPTION\]\... DEVICE \[DIRECTORY\]
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes mount **

[]{#ping .anchor}**2.2.48 goes ping**

-   **Command:**

> **root\@invader44:\~\$ goes ping**

-   **Description:**

> Send ICMP ECHO\_REQUEST to network host.
>
> **\[root\@invader44:\~\# goes ping help**
>
> usage: ping DESTINATION
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes ping 172.17.2.45**
>
> PING 172.17.2.45 (172.17.2.45)
>
> 64 bytes from 172.17.2.45 in 3.232638ms
>
> root\@invader44:\~\#

[]{#ps .anchor}

**2.2.49 goes ps**

-   **Command:**

> **root\@invader44:\~\$ goes ps**

-   **Description:**

> Print process state.
>
> **\[root\@invader44:\~\# goes ps help**
>
> usage: ps \[OPTION\]\...
>
> root\@invader45:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\$ goes ps**
>
> PID TTY TIME CMD
>
> 12082 pts/45 60ms goes
>
> 13172 pts/45 0s sh
>
> 13177 pts/45 0s bash
>
> root\@invader44:\~\$

[]{#pwd .anchor}**2.2.50 goes pwd**

-   **Command:**

> **root\@invader44:\~\$ goes pwd**

-   **Description:**

> Print working directory.
>
> **\[root\@invader44:\~\# goes pwd help**
>
> usage: pwd \[-L\]
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> []{#qsfp .anchor}**root\@invader44:\~\# pwd**
>
> **/root**
>
> **root\@invader44:\~\#**

**2.2.51 goes qsfp**

-   **Command:**

> **root\@invader44:\~\$ goes qsfp**

-   **Description:**

> Qsfp monitoring daemon, publishes to redis.
>
> **\[root\@invader44:\~\# goes qsfp help**
>
> usage: qsfp
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes qsfp**

[]{#rebooot .anchor}**2.2.52 goes reboot**

-   **Command:**

> **root\@invader44:\~\$ goes reboot**

-   **Description:**

> Reboot the system.
>
> **\[root\@invader44:\~\# goes reboot help**
>
> usage: reboot
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes reboot**

[]{#redisd .anchor}

**2.2.53 goes redisd**

-   **Command:**

> **root\@invader44:\~\$ goes redisd**

-   **Description:**

> A redis server.
>
> **\[root\@invader44:\~\# goes redisd help**
>
> usage: redisd \[-port PORT\] \[-set FIELD=VALUE\]\... \[DEVICE\]\...
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes redisd**
>
> listen unix \@platina-mk1/redisd: bind: address already in use
>
> root\@invader44:\~\#

[]{#reload .anchor}

**2.2.54 goes reload**

-   **Command:**

> **root\@invader44:\~\$ goes reload**

-   **Description:**

> SIGHUP this goes machine.
>
> **\[root\@invader44:\~\# goes reload help**
>
> usage: reload
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes reload**

[]{#restart .anchor}

**2.2.55 goes restart**

-   **Command:**

> **root\@invader44:\~\$ goes restart**

-   **Description:**

> Stop, then start this goes machine.
>
> **\[root\@invader44:\~\# goes restart help**
>
> usage: restart \[STOP, STOP, and REDISD OPTIONS\]\...
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes restart**
>
> **root\@invader44:\~\#**[]{#rm .anchor}

**2.2.56 goes rm**

-   **Command:**

> **root\@invader44:\~\$ goes rm**

-   **Description:**

> Remove files or directories.
>
> **\[root\@invader44:\~\# goes rm help**
>
> usage: rm \[OPTION\]\... FILE...
>
> root\@invader45:\~\#**\]**

-   **Examples:**

> **root\@invader45:\~\# goes** ls
>
> goes-platina-mk1-installer
>
> goesd-platina-mk1-modprobe.conf
>
> goesd-platina-mk1-modules.conf
>
> goesd-platina-mk1-sysctl.conf
>
> linux-image-platina-mk1-4.13.0.deb
>
> .ansible .profile cb.rom
>
> .bash\_history .ssh coreboot-platina-mk1.rom
>
> .bashrc .vim testfile.txt
>
> .config .viminfo testfile55.txt
>
> .history\_quagga .vimrc tools
>
> .lesshst .vimrc.swp volumes
>
> **root\@invader45:\~\# goes rm testfile55.txt**
>
> **root\@invader45:\~\#**
>
> **root\@invader45:\~\# goes ls**
>
> goes-platina-mk1-installer
>
> goesd-platina-mk1-modprobe.conf
>
> goesd-platina-mk1-modules.conf
>
> goesd-platina-mk1-sysctl.conf
>
> linux-image-platina-mk1-4.13.0.deb
>
> .ansible .profile cb.rom
>
> .bash\_history .ssh coreboot-platina-mk1.rom
>
> .bashrc .vim testfile.txt
>
> .config .viminfo tools
>
> .history\_quagga .vimrc volumes
>
> .lesshst .vimrc.swp
>
> **root\@invader45:\~\#**

[]{#rmmod .anchor}**2.2.57 goes rmmod**

-   **Command:**

> **root\@invader44:\~\$ goes rmmod**

-   **Description:**

> Remove a module from the Linux Kernel.
>
> **\[root\@invader44:\~\# goes rmmod help**
>
> usage: rmmod \[OPTION\]\... MODULE\...
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes rmmod**

[]{#show .anchor}

**2.2.58 goes show**

-   **Command:**

> **root\@invader44:\~\$ goes show**

-   **Description:**

> Print stuff.
>
> **\[root\@invader44:\~\# goes show help**
>
> usage: show OBJECT
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes show**

[]{#sleep .anchor}**2.2.59 goes sleep**

-   **Command:**

> **root\@invader44:\~\$ goes sleep**

-   **Description:**

> Suspend execution for an interval of time.
>
> **\[root\@invader44:\~\# goes sleep help**
>
> usage: sleep SECONDS
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes sleep**

[]{#source .anchor}**2.2.60 goes source**

-   **Command:**

> **root\@invader44:\~\$ goes source**

-   **Description:**

> Import command script.
>
> **\[root\@invader44:\~\# goes source help**
>
> usage: source \[-x\] FILE
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes source**

[]{#start .anchor}**2.2.61 goes start**

-   **Command:**

> **root\@invader44:\~\$ goes start**

-   **Description:**

> Start this goes machine.
>
> **\[root\@invader44:\~\# goes start help**
>
> usage: start \[-start=URL\] \[REDIS OPTIONS\]\...
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes start**

**2.2.62 goes status**

-   **Command:**

> **root\@invader44:\~\$ goes status**

-   **Description:**

> Print status of goes daemons.
>
> **\[root\@invader44:\~\# goes status help**
>
> usage: status
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader29:\~\# goes status**
>
> GOES status
>
> ======================
>
> Mode - SRIOV
>
> PCI - OK
>
> Check daemons - OK
>
> Check Redis - OK
>
> Check vnet - OK
>
> root\@invader29:\~\#

**2.2.63 goes stop**

-   **Command:**

> **root\@invader44:\~\$ goes stop**

-   **Description:**

> Stop this goes machine.
>
> **\[root\@invader44:\~\# goes stop help**
>
> usage: stop \[-stop=URL\] \[SIGNAL\]
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes stop**

[]{#stty .anchor}**2.2.64 goes stty**

-   **Command:**

> **root\@invader44:\~\$ goes stty**

-   **Description:**

> Print info for given or current TTY.
>
> **\[root\@invader44:\~\# goes stty help**
>
> usage: stty \[DEVICE\]
>
> root\@invader45:\~\#**\]**

-   **Examples:**

> **root\@invader45:\~\# goes stty**
>
> name /dev/pts/2
>
> speed 38400 baud; rows ; columns ; line 0;
>
> intr = \^C; quit = \^\\; erase = \^?; kill = \^U; eof = \^D; min =
> \^A; start = \^Q; stop = \^S; susp = \^Z; reprint = \^R; discard =
> \^O; werase = \^W; lnext = \^V;
>
> -parenb -parodd -cmspar cs8 -hupcl -cstopb cread -clocal -crtscts
>
> -ignbrk -brkint -ignpar -parmrk -inpck -istrip -inlcr -igncr icrnl
> ixon -ixoff -iuclc -ixany -imaxbel -iutf8
>
> opost -olcuc -ocrnl onlcr -onocr -onlret -ofill -ofdel
>
> isig icanon iexten echo echoe echok -echonl -noflsh -xcase -tostop
> echoctl -echoprt echoke -flusho -pendin
>
> root\@invader45:\~\#

[]{#subscribe .anchor}**2.2.65 goes subscribe**

-   **Command:**

> **root\@invader44:\~\$ goes subscribe**

-   **Description:**

> Print messages published to given redis channel.
>
> **\[root\@invader44:\~\# goes subscribe help**
>
> usage: subscribe CHANNEL
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes subscribe**

[]{#sync .anchor}**2.2.66 goes sync**

-   **Command:**

> **root\@invader44:\~\$ goes sync**

-   **Description:**

> Flush the file system buffers.
>
> **\[root\@invader44:\~\# goes sync help**
>
> usage: sync
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes sync**

[]{#tempd .anchor}**2.2.67 goes tempd**

-   **Command:**

> **root\@invader44:\~\$ goes tempd**

-   **Description:**

> Temperature monitoring daemon, publishes to redis.
>
> **\[root\@invader44:\~\# goes tempd help**
>
> usage: tempd
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes tempd**

[]{#then .anchor}**2.2.68 goes then**

-   **Command:**

> **root\@invader44:\~\$ goes then**

-   **Description:**

> Conditionally execute commands.
>
> **\[root\@invader44:\~\# goes then help**
>
> usage: if COMMAND ; then COMMAND else COMMAND endif
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes then**

[]{#toggle .anchor}**2.2.69 goes toggle**

-   **Command:**

> **root\@invader44:\~\$ goes toggle**

-   **Description:**

> Toggle console port between x86 and BMC.
>
> **\[root\@invader44:\~\# goes toggle help**
>
> usage: toggle SECONDS
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes toggle**

[]{#true .anchor}**2.2.70 goes true**

-   **Command:**

> **root\@invader44:\~\$ goes true**

-   **Description:**

> Returns 'successful' not matter what.
>
> **\[root\@invader44:\~\# goes true help**
>
> usage: true
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes true**

[]{#umount .anchor}**2.2.71 goes umount**

-   **Command:**

> **root\@invader44:\~\$ goes umount**

-   **Description:**

> Deactivate file-systems.
>
> **\[root\@invader44:\~\# goes umount help**
>
> usage: umount \[OPTION\]\... FILESYSTEM\|DIR
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes umount**

[]{#uninstall .anchor}**2.2.72 goes uninstall**

-   **Command:**

> **root\@invader44:\~\$ goes uninstall**

-   **Description:**

> Uninstall this goes machine.
>
> **\[root\@invader44:\~\# goes uninstall help**
>
> usage: uninstall
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes uninstall**

[]{#upgrade .anchor}**2.2.73 goes upgrade**

-   **Command:**

> **root\@invader44:\~\$ goes upgrade**

-   **Description:**

> Upgrade images.
>
> **\[root\@invader44:\~\# goes upgrade help**
>
> usage: upgrade \[-v VER\] \[-s SERVER\[/dir\]\] \[-r\] \[-l\] \[-t\]
> \[-a \| -g -k -c\] \[-f\]
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes upgrade**

[]{#uptimed .anchor}**2.2.74 goes uptimed**

-   **Command:**

> **root\@invader44:\~\$ goes uptimed**

-   **Description:**

> Record system uptime in redis.
>
> **\[root\@invader44:\~\# goes uptimed help**
>
> usage: uptimed
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes uptimed**

[]{#vnet .anchor}**2.2.75 goes vnet**

-   **Command:**

> **root\@invader44:\~\$ goes vnet**

-   **Description:**

> Send commands to hidden CLI.
>
> **\[root\@invader44:\~\# goes vnet help**
>
> usage:
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes vnet**

[]{#VnetEventLog .anchor}**2.2.75.1 goes vnet show event-log**

-   **Command:**

> **root\@invader44:\~\$ goes vnet show event-log**

-   **Description:**

> Event log commands.

-   **Examples:**

> **root\@invader44:\~\# goes vnet show event-log**
>
> root\@invader44:\~\#

[]{#VnetShowBuffers .anchor}**2.2.75.2 goes vnet show buffers**

-   **Command:**

> **root\@invader44:\~\$ goes vnet show buffers**

-   **Description:**

> Shows DMA(direct memory access) buffer usage.

-   **Examples:**

> **root\@invader44:/\# goes vnet show buffers**
>
> DMA heap: used 5.27M, free 73.88K, capacity 256M
>
> Pool Size Free Used
>
> default 1088 0 0
>
> fe1-rx 1088 217.31K 4.94M
>
> pg0 1088 0 0
>
> root\@invader44:/\#

[]{#VnetShowErrors .anchor}**2.2.75.3 goes vnet show errors**

-   **Command:**

> **root\@invader44:\~\$ goes vnet show errors**

-   **Description:**

> Shows Error counters..

-   **Examples:**

> **root\@invader44:/\# goes vnet show errors**
>
> Node Error Count
>
> fe1-rx management duplicate 9
>
> fe1-rx-vlan-redirect not vlan tagged 16
>
> root\@invader44:/\#

[]{#VnetShowFe1Adj .anchor}**2.2.75.4 goes vnet show fe1 adj**

-   **Command:**

> **root\@invader44:\~\$ goes vnet show fe1 adj**

-   **Description:**

> Shows adjacencies.
>
> There are different options that can be used:

12. **goes vnet show fe1 adj detail**

13. **goes vnet show fe1 adj sw**

14. **goes vnet show fe1 adj raw**

15. **goes vnet show fe1 adj detail eth-1-1**

16. **goes vnet show fe1 adj sw eth-1-1**

17. **goes vnet show fe1 adj raw eth-1-1**

-   **Examples:**

> **root\@invader44:\~\# goes vnet show fe1 adj sw eth-1-1**
>
> sw/asic rx\_pipe index free/used ipAdj type port drop copyCpu \...
> tx\_pipe type dstRewrite srcRewrite classID dstAddr if\_index si\_name
>
> hardware 0 2 used nil unicast meth-1 false false \... 1 l3\_unicast
> false false 0 00:00:00:00:00:00 2 eth-1-1
>
> software 0 2 used nil unicast meth-1 false false \... 1 l3\_unicast
> false false 0 00:00:00:00:00:00 2 eth-1-12
>
> root\@invader44:\~\#

[]{#VnetShowFe1DebugEvents .anchor}

**2.2.75.5 goes vnet show fe1 debug-events**

-   **Command:**

> **root\@invader44:\~\$ goes vnet show fe1 debug-events**

-   **Description:**

> Shows Debug events.

-   **Examples:**

> **root\@invader44:\~\# goes vnet show fe1 debug-events**
>
> no debug events
>
> root\@invader44:\~\#

[]{#VnetShowFe1EyeSummary .anchor}**2.2.75.6 goes vnet show fe1
eye-summary**

-   **Command:**

> **root\@invader44:\~\$ goes vnet show fe1 eye-summary**

-   **Description:**

> Shows Eye-Summary.
>
> This command has 2 options

18. goes vnet show fe1 eye-summary :- Shows full eye-summary

19. goes vnet show fe1 eye-summary \[Interface\] :-Shows eye-summary of
    that interface

-   **Examples:**

> **root\@invader44:/\# goes vnet show fe1 eye-summary eth-2-1**
>
> Port Lane Horizontal/Vertical Raw Left/Lower Raw Right/Upper
> Width/Height Center
>
> eth-2-1 lane1 Horizontal 0x0 0x0 0 mUI 0%
>
> eth-2-1 lane1 Vertical 0x0 0x0 0 mV 0%
>
> eth-2-1 lane2 Horizontal 0x0 0x0 0 mUI 0%
>
> eth-2-1 lane2 Vertical 0x0 0x0 0 mV 0%
>
> eth-2-1 lane3 Horizontal 0x0 0x0 0 mUI 0%
>
> eth-2-1 lane3 Vertical 0x0 0x0 0 mV 0%
>
> eth-2-1 lane4 Horizontal 0x0 0x0 0 mUI 0%
>
> eth-2-1 lane4 Vertical 0x0 0x0 0 mV 0%
>
> root\@invader44:/\#

[]{#VnetShowFe1EyeScan .anchor}**2.2.75.7 goes vnet show fe1 eyescan**

-   **Command:**

> **root\@invader44:\~\$ goes vnet show fe1 eyescan**

-   **Description:**

> Shows eye-scanning results.

-   **Examples:**

> **root\@invader44:/\# goes vnet show fe1 eyescan**
>
> Starting eye scan for port eth-1-1, lane 0
>
> Failed: pmd not locked
>
> Starting eye scan for port eth-1-1, lane 1
>
> Failed: pmd not locked
>
> Starting eye scan for port eth-1-1, lane 2
>
> Failed: pmd not locked
>
> Starting eye scan for port eth-1-1, lane 3
>
> Failed: pmd not locked
>
> \...
>
> \...
>
> root\@invader44:/\#

[]{#VnetShowFe1Interrupt .anchor}**2.2.75.8 goes vnet show fe1
interrupt**

-   **Command:**

> **root\@invader44:\~\$ goes vnet show fe1 interrupt**

-   **Description:**

> Shows corresponding interrupts.

-   **Examples:**

> **root\@invader44:/\# goes vnet show fe1 interrupt**
>
> Interrupt Count Rate
>
> packet dma ch 0 desc controlled 103 4.14e-04
>
> packet dma ch 0 desc done 103 4.14e-04
>
> phy scan link status 18 7.24e-05
>
> pio done 34 1.37e-04
>
> sbus dma ch 0 done 13209373 5.31e+01
>
> sbus dma ch 1 done 13209374 5.31e+01
>
> sbus dma ch 2 done 13209373 5.31e+01
>
> polls 39495285 1.59e+02
>
> root\@invader44:/\#

[]{#VnetShowFe1L2 .anchor}**2.2.75.9 goes vnet show fe1 l2**

-   **Command:**

> **root\@invader44:\~\$ goes vnet show fe1 l2**

-   **Description:**

> \[not sure\]

-   **Examples:**

> **root\@invader44:\~\# goes vnet show fe1 l2**
>
> root\@invader44:\~\#

[]{#VnetShowFe1Temperature .anchor}**2.2.75.10 goes vnet show fe1
temperature**

-   **Command:**

> **root\@invader44:\~\$ goes vnet show fe1 temperature**

-   **Description:**

> Shows Temperature data.

-   **Examples:**

> **root\@invader44:/\# goes vnet show fe1 temperature**
>
> 0: &{current:58 max:61 min:55}
>
> 1: &{current:57 max:62 min:55}
>
> 2: &{current:59 max:63 min:57}
>
> 3: &{current:58 max:62 min:56}
>
> 4: &{current:57 max:61 min:55}
>
> 5: &{current:58 max:63 min:57}
>
> 6: &{current:57 max:61 min:55}
>
> 7: &{current:57 max:60 min:54}
>
> root\@invader44:/\#

[]{#VnetShowFe1Switches .anchor}**2.2.75.11 goes vnet show fe1
switches**

-   **Command:**

> **root\@invader44:\~\$ goes vnet show fe1 switches**

-   **Description:**

> Shows Switches.

-   **Examples:**

> **root\@invader44:/\# goes vnet show fe1 switches**
>
> 0000:04:00.0: id 0xb960, rev 0x12
>
> root\@invader44:/\#

[]{#VnetShowFe1PhyEventLog .anchor}**2.2.75.12 goes vnet show fe1 phy
event-log**

-   **Command:**

> **root\@invader44:\~\$ goes vnet show fe1 phy event-log**

-   **Description:**

> Shows event logs on every physical port.

-   **Examples:**

> **root\@invader44:/\# goes vnet show fe1 phy event-log**
>
> port-2(ce01): event log
>
> 7.0000e-05: lane 0, uc\_entry\_to\_core\_reset
>
> 1.4372e+02: lane 0, uc\_stop\_event\_log
>
> port-2(ce01): event log
>
> 5.1449e-01: lane 0, uc\_stop\_event\_log
>
> port-2(ce01): event log
>
> 8.4147e-01: lane 0, uc\_stop\_event\_log
>
> port-2(ce01): event log
>
> 5.1418e-01: lane 0, uc\_stop\_event\_log
>
> port-1(ce00): event log
>
> 8.0000e-05: lane 0, uc\_entry\_to\_core\_reset
>
> 1.4502e+02: lane 0, uc\_stop\_event\_log
>
> \...
>
> \...
>
> root\@invader44:/\#

[]{#VnetShowFe1PipeCounters .anchor}**2.2.75.13 goes vnet show fe1
pipe-counters**

-   **Command:**

> **root\@invader44:\~\$ goes vnet show fe1 pipe-counters**

-   **Description:**

> ??.

-   **Examples:**

> **root\@invader44:/\# goes vnet show fe1 pipe-counters**
>
> Name Pipe Packets Bytes
>
> eth-17-1 rx l3 interface 2 9 1034
>
> eth-17-1 rxf rule 2 7 774
>
> key: l3 if: 0x1/ffff
>
> rx port: 0x64/ff
>
> redirect: unicast port eth-17-1
>
> l3 switch change: l2 switch 0
>
> eth-19-1 rx l3 interface 2 9 1034
>
> eth-19-1 rxf rule 2 7 774
>
> key: l3 if: 0x3/ffff
>
> rx port: 0x64/ff
>
> redirect: unicast port eth-19-1
>
> l3 switch change: l2 switch 0
>
> \...
>
> \...
>
> meth-2 vlan-translate 2 7 774
>
> key: outer id 118=0x76, src: src port meth-2
>
> result: outer: 0, inner: 0, l3 if: 0xd, tag action: 1
>
> meth-2 vlan-translate 2 7 774
>
> key: outer id 126=0x7e, src: src port meth-2
>
> result: outer: 0, inner: 0, l3 if: 0xf, tag action: 1
>
> root\@invader44:/\#

[]{#VnetShowFe1PortStatusMac .anchor}**2.2.75.14 goes vnet show fe1
port-status mac**

-   **Command:**

> **root\@invader44:\~\$ goes vnet show fe1 port-status mac**

-   **Description:**

> Shows MAC Port-Status.

-   **Examples:**

> **root\@invader44:/\# sudo goes vnet show fe1 port-status mac**
>
> Name Link Up Signal Detect Pmd Lock RemoteF Eq Link Down LocalF Eq
> Link Down
>
> eth-1-1 false false false true false
>
> eth-2-1 false false false true false
>
> eth-3-1 false false false true false
>
> \...
>
> \...
>
> meth-1 true true true true false
>
> meth-2 true true true true false
>
> root\@invader44:/\#

[]{#VnetShowFe1PortStatusPhy .anchor}**2.2.75.15 goes vnet show fe1
port-status phy**

-   **Command:**

> **root\@invader44:\~\$ goes vnet show fe1 port-status phy**

-   **Description:**

> Shows Physical Port-Status.
>
> This command has 3 options:
>
> **1) goes vnet show fe1 port-status phy **
>
> **2) goes vnet show fe1 port-status phy \[Interface\]**
>
> **3) goes vnet show fe1 port-status phy \[Interface\] detail**

-   **Examples:**

> **1) root\@invader44:\~\# goes vnet show fe1 port phy eth-1-1**
>
> Port Lane Live Link Signal Detect Admin Down Pmd Lock Sigdet Sts Speed
> Autonegotiate Cl72 Fec
>
> eth-1-1 0 true true false true 0x211 100G X4 CR done ready cl91
>
> eth-1-1 1 false true false true 0x211 100G X4 CR ready cl91
>
> eth-1-1 2 false true false true 0x211 100G X4 CR ready cl91
>
> eth-1-1 3 false true false true 0x211 100G X4 CR ready cl91
>
> root\@invader44:\~\#
>
> **2) root\@invader44:\~\# goes vnet show fe1 port phy eth-1-1 detail**
>
> Port Lane Live Link Signal Detect Admin Down Pmd Lock Sigdet Sts Speed
> Autonegotiate Cl72 Fec
>
> eth-1-1 0 true true false true 0x211 100G X4 CR done ready cl91
>
> eth-1-1 1 false true false true 0x211 100G X4 CR ready cl91
>
> eth-1-1 2 false true false true 0x211 100G X4 CR ready cl91
>
> eth-1-1 3 false true false true 0x211 100G X4 CR ready cl91
>
> eth-1-1
>
> cl82 stats
>
> deskew\_align\_aquired : false
>
> deskew\_loss\_of\_alignment : true
>
> deskew\_r\_type : 0x10
>
> deskew\_rxsm\_state : 0x2
>
> cl82\_ber : 0
>
> cl82\_tx\_idle\_del\_underflow : false
>
> cl82\_t\_type\_coded : 4
>
> cl82\_txsm\_state : 1
>
> pcs stats : lane0 lane1 lane2 lane3
>
> live\_link : true false false false
>
> rx\_deskew\_achieved : true false false false
>
> rx\_high\_bit\_error : false false false false
>
> rx\_low\_power\_idle\_received : false false false false
>
> rx\_link\_interrupt : false false false false
>
> rx\_remote\_fault : false false false false
>
> rx\_local\_fault : false false false false
>
> tx\_low\_power\_idle\_received : false false false false
>
> tx\_link\_interrupt : false false false false
>
> tx\_remote\_fault : false false false false
>
> tx\_local\_fault : false false false false
>
> sc stats
>
> cl72\_en : true true true true
>
> os\_mode : 0 0 0 0
>
> t\_fifo\_mode : 0x2 0x2 0x2 0x2
>
> t\_enc\_mode : 0x2 0x2 0x2 0x2
>
> t\_hg2\_en : false false false false
>
> t\_pma\_btmx\_mode : 0x0 0x0 0x0 0x0
>
> scr\_mode : 0x3 0x3 0x3 0x3
>
> descr\_mode : 0x2 0x2 0x2 0x2
>
> dec\_tl\_mode : 0x2 0x2 0x2 0x2
>
> deskew\_mode : 0x6 0x6 0x6 0x6
>
> dec\_fsm\_mode : 0x2 0x2 0x2 0x2
>
> r\_hg2\_en : false false false false
>
> block\_sync\_mode : clause82 clause82 clause82 clause82
>
> block\_sync\_enable : false false false false
>
> block\_dist\_mode : 0 0 0 0
>
> block\_bitmux\_mode : 0 0 0 0
>
> sc\_fsm\_status : done start start start
>
> root\@invader44:\~\#

[]{#VnetShowFe1SerdesParam .anchor}**2.2.75.16 goes vnet show fe1
serdes-param**

-   **Command:**

> **root\@invader44:\~\$ goes vnet show fe1 serdes-param**

-   **Description:**

> ???.

-   **Examples:**

> **1)root\@invader44:/\# goes vnet show fe1 serdes-param**
>
> Name Lane Main Pre Post1 Post2 Post3 Amplitude Drive sdk TxDis pmd
> TxEna
>
> eth-1-1 lane1 100 12 44 0 0 8 0 0 1
>
> eth-1-1 lane2 100 12 44 0 0 8 0 0 1
>
> eth-1-1 lane3 100 12 44 0 0 8 0 0 1
>
> eth-1-1 lane4 100 12 44 0 0 8 0 0 1
>
> \...
>
> \...
>
> interface conversion: m.Phyer is \*phy.FortyGig, not \*phy.HundredGig
>
> root\@invader44:/\#
>
> **2)** **root\@invader44:\~\# goes vnet show fe1 serdes-param
> eth-1-1**
>
> Name Lane Main Pre Post1 Post2 Post3 Amplitude Drive sdk TxDis pmd
> TxEna
>
> eth-1-1 lane1 100 12 44 0 0 8 0 1 1
>
> eth-1-1 lane2 100 12 44 0 0 8 0 1 1
>
> eth-1-1 lane3 100 12 44 0 0 8 0 1 1
>
> eth-1-1 lane4 100 12 44 0 0 8 0 1 1
>
> root\@invader44:\~\#

[]{#VnetShowFe1L3Interface .anchor}**2.2.75.17 goes vnet show fe1
l3-interface**

-   **Command:**

> **root\@invader44:\~\$ goes vnet show fe1 l3-interface**

-   **Description:**

> Shows Interface details.
>
> This command has different options:

20. **goes vnet show fe1 l3-interface **

21. **goes vnet show fe1 l3-interface tx**

22. **goes vnet show fe1 l3-interface rx **

23. **goes vnet show fe1 l3-interface tx pipe \[Interface\]**

24. **goes vnet show fe1 l3-interface tx pipe raw eth-1-1**

25. **goes vnet show fe1 l3-interface rx pipe eth-1-1**

26. **goes vnet show fe1 l3-interface rx pipe raw eth-1-1**

-   **Examples:**

> **1)root\@invader44:\~\# goes vnet show fe1 l3-interface**
>
> rx pipe 0=======================================
>
> software\_intf:pg0 tunnel:no tunnel is\_tx\_punt:false if\_index:0
> ref\_count:0 disposition:0
>
> rx\_vlan\_translate: no
>
> punt\_redirect: rx\_l3\_if\_index:0, rxf\_class\_id:nil
>
> punt\_config: not punt
>
> adjacency: is\_ecmp:false, rxf\_class\_id:nil, index:0
>
> rx\_l3\_interface\_entry 0: software / hardware
>
> vrf: 0 / 0
>
> rx\_l3\_interface\_profile\_index: 0 / 0
>
> rxf\_class\_id: 0 / 0
>
> ip\_multicast\_interface\_for\_lookup\_keys: 0 / 0
>
> ip\_option\_profile\_index: 0 / 0
>
> active\_rx\_l3\_interface\_profile\_index: 0 / 0
>
> src\_realm\_id: 0 / 0
>
> tunnel\_termination\_ecn\_decap\_mapping\_pointer: 0 / 0
>
> pipe\_counter\_ref: invalid / invalid
>
> software\_intf:fe1-cpu tunnel:no tunnel is\_tx\_punt:false if\_index:1
> ref\_count:1 disposition:0
>
> rx\_vlan\_translate: no
>
> punt\_redirect: rx\_l3\_if\_index:1, rxf\_class\_id:punt
>
> punt\_config: next:punt, RefOpaque{intf:fe1-cpu, aux:0},
> advanceL3Header:false, NReplaceVlanHeaders:0,
> ReplacementTypeAndTag:\[{0x0 0} {0x0 0}\]
>
> adjacency: is\_ecmp:false, rxf\_class\_id:punt, index:1
>
> rx\_l3\_interface\_entry 1: software / hardware
>
> vrf: 0 / 0
>
> rx\_l3\_interface\_profile\_index: 0 / 0
>
> rxf\_class\_id: 0 / 0
>
> ip\_multicast\_interface\_for\_lookup\_keys: 0 / 0
>
> ip\_option\_profile\_index: 0 / 0
>
> active\_rx\_l3\_interface\_profile\_index: 0 / 0
>
> src\_realm\_id: 0 / 0
>
> tunnel\_termination\_ecn\_decap\_mapping\_pointer: 0 / 0
>
> pipe\_counter\_ref: {pool\_index:0, mode:0, index:1} / {pool\_index:0,
> mode:0, index:1}
>
> software\_intf:eth-1-1 tunnel:no tunnel is\_tx\_punt:false if\_index:2
> ref\_count:1 disposition:0
>
> rx\_vlan\_translate: no
>
> punt\_redirect: rx\_l3\_if\_index:2, rxf\_class\_id:punt
>
> punt\_config: next:punt, RefOpaque{intf:eth-1-1, aux:0},
> advanceL3Header:false, NReplaceVlanHeaders:0,
> ReplacementTypeAndTag:\[{0x0 0} {0x0 0}\]
>
> adjacency: is\_ecmp:false, rxf\_class\_id:punt, index:2
>
> rx\_l3\_interface\_entry 2: software / hardware
>
> vrf: 0 / 0
>
> rx\_l3\_interface\_profile\_index: 0 / 0
>
> rxf\_class\_id: 0 / 0
>
> ip\_multicast\_interface\_for\_lookup\_keys: 0 / 0
>
> ip\_option\_profile\_index: 0 / 0
>
> active\_rx\_l3\_interface\_profile\_index: 0 / 0
>
> src\_realm\_id: 0 / 0
>
> tunnel\_termination\_ecn\_decap\_mapping\_pointer: 0 / 0
>
> pipe\_counter\_ref: {pool\_index:0, mode:0, index:2} / {pool\_index:0,
> mode:0, index:2}
>
> \...
>
> \...
>
> software\_intf:eth-32-1 tunnel:no tunnel is\_tx\_punt:false
> if\_index:8 ref\_count:1 disposition:0
>
> rx\_vlan\_translate: no
>
> punt\_redirect: rx\_l3\_if\_index:8, rxf\_class\_id:punt
>
> punt\_config: next:punt, RefOpaque{intf:eth-32-1, aux:0},
> advanceL3Header:false, NReplaceVlanHeaders:0,
> ReplacementTypeAndTag:\[{0x0 0} {0x0 0}\]
>
> adjacency: is\_ecmp:false, rxf\_class\_id:punt, index:16
>
> rx\_l3\_interface\_entry 8: software / hardware
>
> vrf: 0 / 0
>
> rx\_l3\_interface\_profile\_index: 0 / 0
>
> rxf\_class\_id: 0 / 0
>
> ip\_multicast\_interface\_for\_lookup\_keys: 0 / 0
>
> ip\_option\_profile\_index: 0 / 0
>
> active\_rx\_l3\_interface\_profile\_index: 0 / 0
>
> src\_realm\_id: 0 / 0
>
> tunnel\_termination\_ecn\_decap\_mapping\_pointer: 0 / 0
>
> pipe\_counter\_ref: {pool\_index:0, mode:0, index:8} / {pool\_index:0,
> mode:0, index:8}
>
> root\@invader44:\~\#
>
> **2)** **root\@invader44:\~\# goes vnet show fe1 l3-interface tx pipe
> eth-1-1**
>
> tx pipe 0=======================================
>
> tx pipe 1=======================================
>
> software\_intf:eth-1-1 tunnel:no tunnel is\_tx\_punt:true if\_index:2
> ref\_count:1 disposition:0 punt\_disposition:0
>
> punt\_config: next:punt, RefOpaque{intf:eth-1-1, aux:0},
> advanceL3Header:false, NReplaceVlanHeaders:0,
> ReplacementTypeAndTag:\[{0x0 0} {0x0 0}\]
>
> tx\_l3\_interface\_entry 2: software / hardware
>
> ip\_tunnel\_index: 65535 / 8191
>
> ip\_ttl\_expired\_threshold: 0 / 0
>
> ip\_dscp\_or\_mapping\_pointer: 0 / 0
>
> ip\_dscp\_select: 0 / 0
>
> txf\_class\_id: 0 / 0
>
> l2\_switch: false / false
>
> inner\_vlan: {id:0, priority\_spec:{0 false 0 0}} / {id:0,
> priority\_spec:{0 false 0 0}}
>
> outer\_vlan: {id:6, priority\_spec:{0 false 0 0}} / {id:6,
> priority\_spec:{0 false 0 0}}
>
> inner\_vlan\_present\_action: 0 / 0
>
> inner\_vlan\_add\_if\_absent: false / false
>
> src\_ethernet\_address: 50:18:4c:00:15:9c / 50:18:4c:00:15:9c
>
> tx pipe 2=======================================
>
> tx pipe 3=======================================
>
> root\@invader44:\~\#

[]{#VnetShowFe1PortMap .anchor}**2.2.75.18 goes vnet show fe1 port-map**

-   **Command:**

> **root\@invader44:\~\$ goes vnet show fe1 port-map**

-   **Description:**

> Shows Mapping of Ports.
>
> This command has different options:

27. goes vnet show fe1 port-map

28. goes vnet show fe1 port-map mmu

29. goes vnet show fe1 port-map phy

30. goes vnet show fe1 port-map vlan

31. goes vnet show fe1 port-map pipe

32. goes vnet show fe1 port-map \[Interface\]

33. goes vnet show fe1 port-map all

-   **Examples:**

> **1) root\@invader44:\~\# sudo goes vnet show fe1 port-map**
>
> eth-2-1( 1) eth-1-1( 5) eth-4-1( 9) eth-3-1( 13)
>
> eth-6-1( 17) eth-5-1( 21) eth-8-1( 25) eth-7-1( 29)
>
> eth-10-1( 34) eth-9-1( 38) eth-12-1( 42) eth-11-1( 46)
>
> eth-14-1( 50) eth-13-1( 54) eth-16-1( 58) eth-15-1( 62)
>
> eth-18-1( 68) eth-17-1( 72) eth-20-1( 76) eth-19-1( 80)
>
> eth-22-1( 84) eth-21-1( 88) eth-24-1( 92) eth-23-1( 96)
>
> eth-26-1(102) eth-25-1(106) eth-28-1(110) eth-27-1(114)
>
> eth-30-1(118) eth-29-1(122) eth-32-1(126) eth-31-1(130)
>
> meth-1( 66) meth-2(100)
>
> root\@invader44:\~\#
>
> **2)** **root\@invader44:\~\# goes vnet show fe1 port-map mmu**
>
> eth-2-1( 0) eth-1-1( 2) eth-4-1( 4) eth-3-1( 6)
>
> eth-6-1( 8) eth-5-1( 10) eth-8-1( 12) eth-7-1( 14)
>
> eth-10-1( 64) eth-9-1( 66) eth-12-1( 68) eth-11-1( 70)
>
> eth-14-1( 72) eth-13-1( 74) eth-16-1( 76) eth-15-1( 78)
>
> eth-18-1(128) eth-17-1(130) eth-20-1(132) eth-19-1(134)
>
> eth-22-1(136) eth-21-1(138) eth-24-1(140) eth-23-1(142)
>
> eth-26-1(192) eth-25-1(194) eth-28-1(196) eth-27-1(198)
>
> eth-30-1(200) eth-29-1(202) eth-32-1(204) eth-31-1(206)
>
> meth-1( 96) meth-2(160)
>
> root\@invader44:\~\#
>
> **3)** **root\@invader44:\~\# goes vnet show fe1 port-map vlan**
>
> eth-2-1( 2) eth-1-1( 6) eth-4-1( 10) eth-3-1( 14)
>
> eth-6-1( 18) eth-5-1( 22) eth-8-1( 26) eth-7-1( 30)
>
> eth-10-1( 34) eth-9-1( 38) eth-12-1( 42) eth-11-1( 46)
>
> eth-14-1( 50) eth-13-1( 54) eth-16-1( 58) eth-15-1( 62)
>
> eth-18-1( 66) eth-17-1( 70) eth-20-1( 74) eth-19-1( 78)
>
> eth-22-1( 82) eth-21-1( 86) eth-24-1( 90) eth-23-1( 94)
>
> eth-26-1( 98) eth-25-1( 102) eth-28-1( 106) eth-27-1( 110)
>
> eth-30-1( 114) eth-29-1( 118) eth-32-1( 122) eth-31-1( 126)
>
> meth-1( 130) meth-2( 132)
>
> root\@invader44:\~\#

[]{#VnetShowFe1PortTable .anchor}**2.2.75.19 goes vnet show fe1
port-table**

-   **Command:**

> **root\@invader44:\~\$ goes vnet show fe1 port-table**

-   **Description:**

> Shows Port tables of different Interfaces.
>
> This command has 2 options
>
> **1) goes vnet show fe1 port-table**
>
> **2) goes vnet show fe1 port-table dev \[Interface\]**

-   **Examples:**

> **root\@invader44:\~\# goes vnet show fe1 port-table dev eth-3-1**
>
> port-table\[ 13\] oper:2 disc:false rxf:true vt:true ipv4:true cml:0
> tag\_action\_idx:0 ovid:14 ivid:0 trust:false use\_ivid:false
>
> lport-table\[ 13\] oper:2 disc:false rxf:true vt:true ipv4:true cml:0
> tag\_action\_idx:0 ovid:14 ivid:0 trust:false use\_ivid:false
>
> root\@invader44:\~\#

[]{#VnetShowFe1PrefixPool .anchor}**2.2.75.20 goes vnet show fe1
prefix-pool**

-   **Command:**

> **root\@invader44:\~\$ goes vnet show fe1 prefix-pool**

-   **Description:**

> Show ip46-prefix counter pool entries for all pipes.

-   **Examples:**

> **root\@invader44:\~\# goes vnet show fe1 prefix-pool**
>
> ip46\_prefix\_counter\_pool.entries for pipe 0
>
> 0: class-id punt, vrf 0, 10.0.1.0/24, rule 6/28
>
> rxf rule
>
> key: class id c \[7:0\]: 0x1/ff
>
> ip dst \[31:0\]: 10.0.1.0/24
>
> l3 type \[3:0\]: 0x0/c
>
> vrf \[11:8\]: 0x1/f
>
> vrf \[7:0\]: 0x0/ff
>
> 1: class-id punt, vrf 0, 10.0.1.29/32, rule 6/0
>
> rxf rule
>
> key: class id c \[7:0\]: 0x1/ff
>
> ip dst \[31:0\]: 10.0.1.29/32
>
> l3 type \[3:0\]: 0x0/c
>
> vrf \[11:8\]: 0x1/f
>
> vrf \[7:0\]: 0x0/ff
>
> \...
>
> \...
>
> \...
>
> \...
>
> 62: class-id punt, vrf 0, 10.0.32.0/24, rule 6/63
>
> rxf rule
>
> key: class id c \[7:0\]: 0x1/ff
>
> ip dst \[31:0\]: 10.0.32.0/24
>
> l3 type \[3:0\]: 0x0/c
>
> vrf \[11:8\]: 0x1/f
>
> vrf \[7:0\]: 0x0/ff
>
> 63: class-id punt, vrf 0, 10.0.32.29/32, rule 6/42
>
> rxf rule
>
> key: class id c \[7:0\]: 0x1/ff
>
> ip dst \[31:0\]: 10.0.32.29/32
>
> l3 type \[3:0\]: 0x0/c
>
> vrf \[11:8\]: 0x1/f
>
> vrf \[7:0\]: 0x0/ff
>
> ip46\_prefix\_counter\_pool.entries for pipe 1
>
> 0: class-id punt, vrf 0, 10.0.1.0/24, rule 6/28
>
> rxf rule
>
> key: class id c \[7:0\]: 0x1/ff
>
> ip dst \[31:0\]: 10.0.1.0/24
>
> l3 type \[3:0\]: 0x0/c
>
> vrf \[11:8\]: 0x1/f
>
> vrf \[7:0\]: 0x0/ff
>
> 1: class-id punt, vrf 0, 10.0.1.29/32, rule 6/0
>
> rxf rule
>
> key: class id c \[7:0\]: 0x1/ff
>
> ip dst \[31:0\]: 10.0.1.29/32
>
> l3 type \[3:0\]: 0x0/c
>
> vrf \[11:8\]: 0x1/f
>
> vrf \[7:0\]: 0x0/ff
>
> \...
>
> \...
>
> \...
>
> 62: class-id punt, vrf 0, 10.0.32.0/24, rule 6/63
>
> rxf rule
>
> key: class id c \[7:0\]: 0x1/ff
>
> ip dst \[31:0\]: 10.0.32.0/24
>
> l3 type \[3:0\]: 0x0/c
>
> vrf \[11:8\]: 0x1/f
>
> vrf \[7:0\]: 0x0/ff
>
> 63: class-id punt, vrf 0, 10.0.32.29/32, rule 6/42
>
> rxf rule
>
> key: class id c \[7:0\]: 0x1/ff
>
> ip dst \[31:0\]: 10.0.32.29/32
>
> l3 type \[3:0\]: 0x0/c
>
> vrf \[11:8\]: 0x1/f
>
> vrf \[7:0\]: 0x0/ff
>
> ip46\_prefix\_counter\_pool.entries for pipe 2
>
> 0: class-id punt, vrf 0, 10.0.1.0/24, rule 6/28
>
> rxf rule
>
> key: class id c \[7:0\]: 0x1/ff
>
> ip dst \[31:0\]: 10.0.1.0/24
>
> l3 type \[3:0\]: 0x0/c
>
> vrf \[11:8\]: 0x1/f
>
> vrf \[7:0\]: 0x0/ff
>
> 1: class-id punt, vrf 0, 10.0.1.29/32, rule 6/0
>
> rxf rule
>
> key: class id c \[7:0\]: 0x1/ff
>
> ip dst \[31:0\]: 10.0.1.29/32
>
> l3 type \[3:0\]: 0x0/c
>
> vrf \[11:8\]: 0x1/f
>
> vrf \[7:0\]: 0x0/ff
>
> \...
>
> \...
>
> \...
>
> \...
>
> 63: class-id punt, vrf 0, 10.0.32.29/32, rule 6/42
>
> rxf rule
>
> key: class id c \[7:0\]: 0x1/ff
>
> ip dst \[31:0\]: 10.0.32.29/32
>
> l3 type \[3:0\]: 0x0/c
>
> vrf \[11:8\]: 0x1/f
>
> vrf \[7:0\]: 0x0/ff
>
> ip46\_prefix\_counter\_pool.entries for pipe 3
>
> 0: class-id punt, vrf 0, 10.0.1.0/24, rule 6/28
>
> rxf rule
>
> key: class id c \[7:0\]: 0x1/ff
>
> ip dst \[31:0\]: 10.0.1.0/24
>
> l3 type \[3:0\]: 0x0/c
>
> vrf \[11:8\]: 0x1/f
>
> vrf \[7:0\]: 0x0/ff
>
> 1: class-id punt, vrf 0, 10.0.1.29/32, rule 6/0
>
> rxf rule
>
> key: class id c \[7:0\]: 0x1/ff
>
> ip dst \[31:0\]: 10.0.1.29/32
>
> l3 type \[3:0\]: 0x0/c
>
> vrf \[11:8\]: 0x1/f
>
> vrf \[7:0\]: 0x0/ff
>
> \...
>
> \...
>
> \...
>
> \...
>
> 63: class-id punt, vrf 0, 10.0.32.29/32, rule 6/42
>
> rxf rule
>
> key: class id c \[7:0\]: 0x1/ff
>
> ip dst \[31:0\]: 10.0.32.29/32
>
> l3 type \[3:0\]: 0x0/c
>
> vrf \[11:8\]: 0x1/f
>
> vrf \[7:0\]: 0x0/ff
>
> root\@invader44:\~\#

[]{#VnetShowFe1StationTcam .anchor}**2.2.75.21 goes vnet show fe1
station-tcam**

-   **Command:**

> **root\@invader44:\~\$ goes vnet show fe1 station-tcam**

-   **Description:**

> ???.
>
> This command has 2 options:

34. **goes vnet show fe1 station-tcam**

35. **goes vnet show fe1 station-tcam detail**

-   **Examples:**

> **1)root\@invader44:\~\# goes vnet show fe1 station-tcam**
>
> MY\_STATION\_TCAM\[0\] port={false 0 0} vlan=0 mac=00:00:00:00:00:00
>
> MY\_STATION\_TCAM\[1\] port={false 0 0} vlan=0 mac=00:00:00:00:00:00
>
> MY\_STATION\_TCAM\[2\] port={false 0 0} vlan=0 mac=00:00:00:00:00:00
>
> \...
>
> \...
>
> MY\_STATION\_TCAM\[36\] port={false 0 0} vlan=0 mac=00:00:00:00:00:00
>
> MY\_STATION\_TCAM\[37\] port={false 0 0} vlan=0 mac=00:00:00:00:00:00
>
> MY\_STATION\_TCAM\[38\] port={false 0 0} vlan=0 mac=00:00:00:00:00:00
>
> total: 39 entries
>
> root\@invader44:\~\#
>
> **2)** **root\@invader44:\~\# goes vnet show fe1 station-tcam detail**
>
> {result:{copy\_to\_cpu:false drop:false ip4\_unicast\_enable:true
> ip6\_unicast\_enable:true ip4\_multicast\_enable:true
> ip6\_multicast\_enable:true mpls\_enable:true arp\_rarp\_enable:true
> fcoe\_enable:false trill\_enable:false mac\_in\_mac\_enable:false}
> key:{LogicalPort:{isTrunk:false module:0 number:0} Vlan:0
> EthernetAddress:\[0 0 0 0 0 0\]} mask:{LogicalPort:{isTrunk:false
> module:0 number:0} Vlan:0 EthernetAddress:\[0 0 0 0 0 0\]} valid:true}
>
> MY\_STATION\_TCAM\[0\] port={false 0 0} vlan=0 mac=00:00:00:00:00:00
>
> {result:{copy\_to\_cpu:false drop:false ip4\_unicast\_enable:true
> ip6\_unicast\_enable:true ip4\_multicast\_enable:true
> ip6\_multicast\_enable:true mpls\_enable:true arp\_rarp\_enable:true
> fcoe\_enable:false trill\_enable:false mac\_in\_mac\_enable:false}
> key:{LogicalPort:{isTrunk:false module:0 number:0} Vlan:0
> EthernetAddress:\[0 0 0 0 0 0\]} mask:{LogicalPort:{isTrunk:false
> module:0 number:0} Vlan:0 EthernetAddress:\[0 0 0 0 0 0\]} valid:true}
>
> \...
>
> \...
>
> MY\_STATION\_TCAM\[36\] port={false 0 0} vlan=0 mac=00:00:00:00:00:00
>
> {result:{copy\_to\_cpu:false drop:false ip4\_unicast\_enable:true
> ip6\_unicast\_enable:true ip4\_multicast\_enable:true
> ip6\_multicast\_enable:true mpls\_enable:true arp\_rarp\_enable:true
> fcoe\_enable:false trill\_enable:false mac\_in\_mac\_enable:false}
> key:{LogicalPort:{isTrunk:false module:0 number:0} Vlan:0
> EthernetAddress:\[0 0 0 0 0 0\]} mask:{LogicalPort:{isTrunk:false
> module:0 number:0} Vlan:0 EthernetAddress:\[0 0 0 0 0 0\]} valid:true}
>
> MY\_STATION\_TCAM\[37\] port={false 0 0} vlan=0 mac=00:00:00:00:00:00
>
> {result:{copy\_to\_cpu:false drop:false ip4\_unicast\_enable:true
> ip6\_unicast\_enable:true ip4\_multicast\_enable:true
> ip6\_multicast\_enable:true mpls\_enable:true arp\_rarp\_enable:true
> fcoe\_enable:false trill\_enable:false mac\_in\_mac\_enable:false}
> key:{LogicalPort:{isTrunk:false module:0 number:0} Vlan:0
> EthernetAddress:\[0 0 0 0 0 0\]} mask:{LogicalPort:{isTrunk:false
> module:0 number:0} Vlan:0 EthernetAddress:\[0 0 0 0 0 0\]} valid:true}
>
> MY\_STATION\_TCAM\[38\] port={false 0 0} vlan=0 mac=00:00:00:00:00:00
>
> total: 39 entries
>
> root\@invader44:\~\#

[]{#VnetShowFe1Tcam .anchor}**2.2.75.22 goes vnet show fe1 tcam**

-   **Command:**

> **root\@invader44:\~\$ goes vnet show fe1 tcam**

-   **Description:**

> ????.
>
> This command has 3 options:
>
> **1) goes vnet show fe1 tcam**
>
> **2) goes vnet show fe1 tcam details**
>
> **3) goes vnet show fe1 tcam sw**

-   **Examples:**

> **1)root\@invader44:\~\# goes vnet show fe1 tcam**
>
> pipe\_num prefix\_index prefix\_len n\_half\_entries base\_index
>
> 0 0 /32 64 0
>
> 0 1 /31 0 64
>
> 0 2 /30 0 64
>
> 0 3 /29 0 64
>
> 0 4 /28 0 64
>
> \...
>
> \...
>
> 0 30 /2 0 128
>
> 0 31 /1 0 128
>
> 0 32 /0 0 128
>
> \...
>
> \...
>
> pipe\_num prefix\_index prefix\_len n\_half\_entries base\_index
>
> 3 0 /32 64 0
>
> 3 1 /31 0 64
>
> 3 2 /30 0 64
>
> \...
>
> \...
>
> 3 28 /4 0 128
>
> 3 29 /3 0 128
>
> 3 30 /2 0 128
>
> 3 31 /1 0 128
>
> 3 32 /0 0 128
>
> root\@invader44:\~\#
>
> **2)** **root\@invader44:\~\# goes vnet show fe1 tcam sw**
>
> pipe\_num prefix\_index prefix\_len n\_half\_entries base\_index
>
> 0 0 /32 64 0
>
> 0 1 /31 0 64
>
> 0 2 /30 0 64
>
> \...
>
> \...
>
> 0 30 /2 0 128
>
> 0 31 /1 0 128
>
> 0 32 /0 0 128
>
> \...
>
> \...
>
> \...
>
> pipe\_num prefix\_index prefix\_len n\_half\_entries base\_index
>
> 3 0 /32 64 0
>
> 3 1 /31 0 64
>
> 3 2 /30 0 64
>
> 3 3 /29 0 64
>
> \...
>
> \...
>
> 3 30 /2 0 128
>
> 3 31 /1 0 128
>
> 3 32 /0 0 128
>
> root\@invader44:\~\#

[]{#VnetShowFe1TxPipeBuffer .anchor}**2.2.75.23 goes vnet show fe1
tx-pipe-buffer**

-   **Command:**

> **root\@invader44:\~\$ goes vnet show fe1 tx-pipe-buffer**

-   **Description:**

> ???.

-   **Examples:**

> **root\@invader44:\~\# goes vnet show fe1 tx-pipe-buffer**
>
> port isProvisioned (phys)current\_usage pipe\_port ( mi, mp) mmu\_port
> mmu\_cell\_req\_outstanding buffer\_port\_enable buffer\_soft\_reset
> all\_port
>
> fe1-cpu false ( 0) 0 0 ( 32, 0) 32 11 0x1 0x0 true
>
> eth-2-1 true ( 1) 0 1 ( 0, 0) 0 36 0x1 0x0 true
>
> eth-2-2 false ( 2) 0 2 ( 16, 0) 16 0 0x0 0x0 false
>
> \...
>
> \...
>
> eth-31-3 false (127) 0 132 ( 15, 3) 207 0 0x0 0x0 false
>
> eth-31-4 false (128) 0 133 ( 31, 3) 223 0 0x0 0x0 false
>
> meth-1 true (129) 0 66 ( 32, 1) 96 11 0x1 0x0 true
>
> meth-2 true (131) 0 100 ( 32, 2) 160 11 0x1 0x0 true
>
> fe1-pipe0-loopback false (132) 0 33 ( 33, 0) 33 36 0x1 0x0 false
>
> fe1-pipe1-loopback false (133) 0 67 ( 33, 1) 97 36 0x1 0x0 false
>
> fe1-pipe2-loopback false (134) 0 101 ( 33, 2) 161 36 0x1 0x0 false
>
> fe1-pipe3-loopback false (135) 0 135 ( 33, 3) 225 36 0x1 0x0 false
>
> root\@invader44:\~\#

[]{#VnetShowFe1Visibility .anchor}**2.2.75.24 goes vnet show fe1
visibility**

-   **Command:**

> **root\@invader44:\~\$ goes vnet show fe1 visibility**

-   **Description:**

> ????.

-   **Examples:**

> **root\@invader44:\~\# goes vnet show fe1 visibility**
>
> pipe 0: &{\[0 0\] \[0 0 0 0\] \[0 0 0 0 0 0 0 0\]}
>
> pipe 1: &{\[0 0\] \[0 0 0 0\] \[0 0 0 0 0 0 0 0\]}
>
> pipe 2: &{\[0 0\] \[0 0 0 0\] \[0 0 0 0 0 0 0 0\]}
>
> pipe 3: &{\[0 0\] \[0 0 0 0\] \[0 0 0 0 0 0 0 0\]}
>
> root\@invader44:\~\#

[]{#VnetShowFe1Vlan .anchor}**2.2.75.25 goes vnet show fe1 vlan**

-   **Command:**

> **root\@invader44:\~\$ goes vnet show fe1 vlan**

-   **Description:**

> Shows VLAN information.

-   **Examples:**

> **root\@invader44:\~\# goes vnet show fe1 vlan**
>
> vlan\_tab\[1\]( fe1-cpu meth-1) egr\_vlan\[1\]( fe1-cpu meth-1) ubm()
>
> vlan\_tab\[2\]( fe1-cpu eth-2-1 meth-1) egr\_vlan\[2\]( fe1-cpu
> eth-2-1 meth-1) ubm()
>
> vlan\_tab\[3\]( fe1-cpu eth-2-2 meth-1) egr\_vlan\[3\]( fe1-cpu
> eth-2-2 meth-1) ubm()
>
> vlan\_tab\[4\]( fe1-cpu eth-2-3 meth-1) egr\_vlan\[4\]( fe1-cpu
> eth-2-3 meth-1) ubm()
>
> vlan\_tab\[5\]( fe1-cpu eth-2-4 meth-1) egr\_vlan\[5\]( fe1-cpu
> eth-2-4 meth-1) ubm()
>
> vlan\_tab\[6\]( fe1-cpu eth-1-1 meth-1) egr\_vlan\[6\]( fe1-cpu
> eth-1-1 meth-1) ubm()
>
> vlan\_tab\[7\]( fe1-cpu eth-1-2 meth-1) egr\_vlan\[7\]( fe1-cpu
> eth-1-2 meth-1) ubm()
>
> vlan\_tab\[8\]( fe1-cpu eth-1-3 meth-1) egr\_vlan\[8\]( fe1-cpu
> eth-1-3 meth-1) ubm()
>
> vlan\_tab\[9\]( fe1-cpu eth-1-4 meth-1) egr\_vlan\[9\]( fe1-cpu
> eth-1-4 meth-1) ubm()
>
> \...
>
> \...
>
> vlan\_tab\[126\]( fe1-cpu meth-2 eth-31-1) egr\_vlan\[126\]( fe1-cpu
> meth-2 eth-31-1) ubm()
>
> vlan\_tab\[127\]( fe1-cpu meth-2 eth-31-2) egr\_vlan\[127\]( fe1-cpu
> meth-2 eth-31-2) ubm()
>
> vlan\_tab\[128\]( fe1-cpu meth-2 eth-31-3) egr\_vlan\[128\]( fe1-cpu
> meth-2 eth-31-3) ubm()
>
> vlan\_tab\[129\]( fe1-cpu meth-2 eth-31-4) egr\_vlan\[129\]( fe1-cpu
> meth-2 eth-31-4) ubm()
>
> vlan\_tab\[130\]( fe1-cpu meth-1) egr\_vlan\[130\]( fe1-cpu meth-1)
> ubm()
>
> vlan\_tab\[132\]( fe1-cpu meth-2) egr\_vlan\[132\]( fe1-cpu meth-2)
> ubm()
>
> vlan\_tab\[133\]( fe1-cpu fe1-pipe0-loopback meth-1) egr\_vlan\[133\](
> fe1-cpu fe1-pipe0-loopback meth-1) ubm()
>
> vlan\_tab\[134\]( fe1-cpu meth-1 fe1-pipe1-loopback) egr\_vlan\[134\](
> fe1-cpu meth-1 fe1-pipe1-loopback) ubm()
>
> vlan\_tab\[135\]( fe1-cpu meth-2 fe1-pipe2-loopback) egr\_vlan\[135\](
> fe1-cpu meth-2 fe1-pipe2-loopback) ubm()
>
> vlan\_tab\[136\]( fe1-cpu meth-2 fe1-pipe3-loopback) egr\_vlan\[136\](
> fe1-cpu meth-2 fe1-pipe3-loopback) ubm()
>
> root\@invader44:\~\#

[]{#VnetShowHardwareInterfaces .anchor}**2.2.75.26 goes vnet show
hardware-interfaces**

-   **Command:**

> **root\@invader44:\~\$ goes vnet show hardware-interfaces**

-   **Description:**

> Shows hardware Interface details.

-   **Examples:**

> **root\@invader44:\~\# goes vnet show hardware-interfaces**
>
> Name Address Link Counter Count
>
> eth-1-1 50:18:4c:00:15:9c up tx pipe unicast queue cos0 packets 7
>
> tx pipe unicast queue cos0 bytes 746
>
> tx pipe port table packets 7
>
> tx pipe port table bytes 746
>
> port tx packets 7
>
> port tx bytes 774
>
> port tx 65 to 127 byte packets 5
>
> port tx 128 to 255 byte packets 2
>
> port tx good packets 7
>
> port tx multicast packets 7
>
> eth-3-1 50:18:4c:00:15:a4 up tx pipe unicast queue cos0 packets 7
>
> tx pipe unicast queue cos0 bytes 746
>
> tx pipe port table packets 7
>
> tx pipe port table bytes 746
>
> port tx packets 7
>
> port tx bytes 774
>
> port tx 65 to 127 byte packets 5
>
> port tx 128 to 255 byte packets 2
>
> port tx good packets 7
>
> port tx multicast packets 7
>
> \...
>
> \...
>
> meth-2 00:00:00:00:00:00 up port rx packets 58
>
> port rx bytes 6724
>
> port rx 65 to 127 byte packets 40
>
> port rx 128 to 255 byte packets 18
>
> port rx good packets 58
>
> port rx multicast packets 58
>
> port rx 1tag vlan packets 56
>
> rx pipe port table packets 58
>
> rx pipe port table bytes 6492
>
> rx pipe ip6 header errors 17179869208
>
> rx pipe multicast drops 12884901946
>
> rx pipe vlan tagged packets 12884901944
>
> fe1-cpu 00:00:00:00:00:00 up tx pipe vlan tagged packets 125
>
> tx pipe cpu vlan-redirect packets 125
>
> tx pipe cpu vlan-redirect bytes 14370
>
> tx pipe port table packets 125
>
> tx pipe port table bytes 14370
>
> root\@invader44:\~\#

[]{#VnetShowInterfaces .anchor}**2.2.75.27 goes vnet show interfaces**

-   **Command:**

> **root\@invader44:\~\$ goes vnet show interfaces**

-   **Description:**

> Shows Interface details.

-   **Examples:**

> **root\@invader44:\~\# goes vnet show interfaces**
>
> Name State Counter Count
>
> eth-1-1 up rx pipe l3 interface packets 7
>
> rx pipe l3 interface bytes 774
>
> eth-3-1 up rx pipe l3 interface packets 7
>
> rx pipe l3 interface bytes 774
>
> eth-5-1 up rx pipe l3 interface packets 7
>
> rx pipe l3 interface bytes 774
>
> eth-7-1 up rx pipe l3 interface packets 7
>
> rx pipe l3 interface bytes 774
>
> \...
>
> \...
>
> eth-31-1 up rx packets 2
>
> rx bytes 268
>
> rx pipe l3 interface packets 9
>
> rx pipe l3 interface bytes 1034
>
> meth-1 up rx packets 51
>
> rx bytes 5726
>
> meth-2 up rx packets 58
>
> rx bytes 6500
>
> root\@invader44:\~\#

[]{#VnetShowIpFib .anchor}**2.2.75.28 goes vnet show ip fib**

-   **Command:**

> **root\@invader44:\~\$ goes vnet show ip fib**

-   **Description:**

> Shows IP Forwarding-information-base tables.

-   **Examples:**

> **root\@invader44:\~\# goes vnet show ip fib**
>
> Table Destination Adjacency
>
> default 10.0.1.0/24 3: glean eth-1-1
>
> default 10.0.1.29/32 4: local eth-1-1
>
> default 10.0.2.0/24 5: glean eth-2-1
>
> default 10.0.2.29/32 6: local eth-2-1
>
> default 10.0.3.0/24 7: glean eth-3-1
>
> default 10.0.3.29/32 8: local eth-3-1
>
> default 10.0.4.0/24 9: glean eth-4-1
>
> default 10.0.4.29/32 10: local eth-4-1
>
> default 10.0.5.0/24 11: glean eth-5-1
>
> default 10.0.5.29/32 12: local eth-5-1
>
> \...
>
> \...
>
> default 10.0.29.29/32 60: local eth-29-1
>
> default 10.0.30.0/24 61: glean eth-30-1
>
> default 10.0.30.29/32 62: local eth-30-1
>
> default 10.0.31.0/24 63: glean eth-31-1
>
> default 10.0.31.29/32 64: local eth-31-1
>
> default 10.0.32.0/24 65: glean eth-32-1
>
> default 10.0.32.29/32 66: local eth-32-1
>
> root\@invader44:\~\#

[]{#VnetShowNetlinkNamespaces .anchor}**2.2.75.29 goes vnet show netlink
namespaces**

-   **Command:**

> **root\@invader44:\~\$ goes vnet show netlink namespaces**

-   **Description:**

> Shows netlink-namespaces.

-   **Examples:**

> **root\@invader44:\~\# goes vnet show netlink namespaces**
>
> Interface Type Namespace NSID Si
>
> eth-1-1 vlan default 0x5
>
> eth-2-1 vlan default 0x1
>
> eth-3-1 vlan default 0xd
>
> eth-4-1 vlan default 0x9
>
> eth-5-1 vlan default 0x15
>
> eth-6-1 vlan default 0x11
>
> eth-7-1 vlan default 0x1d
>
> eth-8-1 vlan default 0x19
>
> eth-9-1 vlan default 0x25
>
> eth-10-1 vlan default 0x21
>
> eth-11-1 vlan default 0x2d
>
> eth-12-1 vlan default 0x29
>
> eth-13-1 vlan default 0x35
>
> eth-14-1 vlan default 0x31
>
> eth-15-1 vlan default 0x3d
>
> eth-16-1 vlan default 0x39
>
> eth-17-1 vlan default 0x45
>
> eth-18-1 vlan default 0x41
>
> eth-19-1 vlan default 0x4d
>
> eth-20-1 vlan default 0x49
>
> eth-21-1 vlan default 0x55
>
> eth-22-1 vlan default 0x51
>
> eth-23-1 vlan default 0x5d
>
> eth-24-1 vlan default 0x59
>
> eth-25-1 vlan default 0x65
>
> eth-26-1 vlan default 0x61
>
> eth-27-1 vlan default 0x6d
>
> eth-28-1 vlan default 0x69
>
> eth-29-1 vlan default 0x75
>
> eth-30-1 vlan default 0x71
>
> eth-31-1 vlan default 0x7d
>
> eth-32-1 vlan default 0x79
>
> root\@invader44:\~\#

[]{#VnetShowNetlinkSummary .anchor}**2.2.75.30 goes vnet show netlink
summary**

-   **Command:**

> **root\@invader44:\~\$ goes vnet show netlink summary**

-   **Description:**

> Shows Netlink Summary.

-   **Examples:**

> **root\@invader44:\~\# goes vnet show netlink summary**
>
> Type Ignored Handled
>
> RTM\_NEWADDR 7 47
>
> RTM\_NEWLINK 7 47
>
> RTM\_NEWNEIGH 3090 0
>
> RTM\_NEWROUTE 57 158
>
> Total 3161 252
>
> root\@invader44:\~\#

[]{#VnetShowRuntime .anchor}**2.2.75.31 goes vnet show runtime**

-   **Command:**

> **root\@invader44:\~\$ goes vnet show runtime**

-   **Description:**

> Shows runtime details.
>
> This command has 4 options:

36. **goes vnet show runtime**

37. **goes vnet show runtime detail**

38. **goes vnet show runtime event**

39. **goes vnet show runtime next**

-   **Examples:**

> **1)root\@invader44:\~\# goes vnet show runtime**
>
> Vectors: 125, Vectors/sec: 4.85e-04, Clocks/vector: 21187.40,
> Vectors/call 0.62
>
> Name Index Calls Vectors Suspends Clocks
>
> error 4 100 125 0 5983.99
>
> fe1-rx 9 203 125 0 11709.84
>
> fe1-rx-vlan-redirect out 10 16 16 0 27293.50
>
> root\@invader44:\~\#
>
> **2)** **root\@invader44:\~\# goes vnet show runtime event**
>
> Events: 71367, Events/sec: 1.16e+00, Clocks/event: 14696320.87
>
> Name Events Suspends Clocks
>
> vnet 71367 2748374 14696320.87
>
> root\@invader44:\~\#

[]{#VnetShowPacketGenerator .anchor}**2.2.75.32 goes vnet show
packet-generator**

-   **Command:**

> **root\@invader44:\~\$ goes vnet show packet-generator**

-   **Description:**

> Shows Packet-generator details.

-   **Examples:**

> **root\@invader44:\~\# goes vnet show packet-generator**
>
> Node Name Limit Sent
>
> root\@invader44:\~\#

[]{#VnetClearErrors .anchor}**2.2.75.33 goes vnet clear errors**

-   **Command:**

> **root\@invader44:\~\$ goes vnet clear errors**

-   **Description:**

> Clears error counters.

-   **Examples:**

> **root\@invader44:\~\# goes vnet clear errors**
>
> root\@invader44:\~\#

[]{#VnetClearEventLog .anchor}**2.2.75.34 goes vnet clear event-log**

-   **Command:**

> **root\@invader44:\~\$ goes vnet clear event-log**

-   **Description:**

> Clears events in event log

-   **Examples:**

> **root\@invader44:\~\# goes vnet clear event-log**
>
> root\@invader44:\~\#

[]{#VnetClearFe1Interrupt .anchor}**2.2.75.35 goes vnet clear fe1
interrupt**

-   **Command:**

> **root\@invader44:\~\$ goes vnet clear fe1 interrupt**

-   **Description:**

> Clears Interrupt Configurations.

-   **Examples:**

> **root\@invader44:\~\# goes vnet clear fe1 interrupt**
>
> root\@invader44:\~\#

[]{#VnetClearFe1PipeCounters .anchor}**2.2.75.36 goes vnet clear fe1
pipe-counters**

-   **Command:**

> **root\@invader44:\~\$ goes vnet clear fe1 pipe-counters**

-   **Description:**

> Clears fe1 pipe counters.

-   **Examples:**

> **root\@invader44:\~\# goes vnet clear fe1 pipe-counters**
>
> root\@invader44:\~\#

[]{#VnetClearInterfaces .anchor}**2.2.75.37 goes vnet clear interfaces**

-   **Command:**

> **root\@invader44:\~\$ goes vnet clear interfaces**

-   **Description:**

> Clears interfaces statistics.

-   **Examples:**

> **root\@invader44:\~\# goes vnet clear interfaces**
>
> root\@invader44:\~\#

[]{#VnetClearIPFib .anchor}**2.2.75.38 goes vnet clear ip fib**

-   **Command:**

> **root\@invader44:\~\$ goes vnet clear ip fib**

-   **Description:**

> Clears IP4 forwarding table statistics.

-   **Examples:**

> **root\@invader44:\~\# goes vnet clear ip fib**
>
> root\@invader44:\~\#

[]{#VnetClearNetlinkSummary .anchor}**2.2.75.39 goes vnet clear netlink
summary**

-   **Command:**

> **root\@invader44:\~\$ goes vnet clear netlink summary**

-   **Description:**

> Clears netlink summary counters.

-   **Examples:**

> **root\@invader44:\~\# goes vnet clear netlink summary**
>
> root\@invader44:\~\#

[]{#VnetClearRuntime .anchor}**2.2.75.40 goes vnet clear runtime**

-   **Command:**

> **root\@invader44:\~\$ goes vnet clear runtime**

-   **Description:**

> Clears main-loop runtime statistics.

-   **Examples:**

> **root\@invader44:\~\# goes vnet clear runtime**
>
> root\@invader44:\~\#

[]{#Vnet41EventLog .anchor}**2.2.75.41 goes vnet event-log**

-   **Command:**

> **root\@invader44:\~\$ goes vnet event-log**

-   **Description:**

> Event log commands.

-   **Examples:**

> **root\@invader44:\~\# goes vnet event-log**
>
> root\@invader44:\~\#

[]{#VnetExec .anchor}**2.2.75.42 goes vnet exec**

-   **Command:**

> **root\@invader44:\~\$ goes vnet exec**

-   **Description:**

> Executes the CLI commands from given file(s).

-   **Examples:**

> **root\@invader44:\~\# goes vnet exec**
>
> root\@invader44:\~\#

[]{#VnetFe1ActivateMirror .anchor}**2.2.75.43 goes vnet fe1 activate
mirror**

-   **Command:**

> **root\@invader44:\~\$ goes vnet fe1 activate mirror**

-   **Description:**

> Fe1 activates the mirror profile \<session name\>.

-   **Examples:**

> **root\@invader44:\~\# goes vnet fe1 activate mirror**
>
> root\@invader44:\~\#

[]{#VnetFe1DeactivateMirror .anchor}**2.2.75.44 goes vnet fe1 deactivate
mirror**

-   **Command:**

> **root\@invader44:\~\$ goes vnet fe1 deactivate mirror**

-   **Description:**

> Fe1 deactivates the mirror profile \<session name\>.

-   **Examples:**

> **root\@invader44:\~\# goes vnet fe1 deactivate mirror**
>
> root\@invader44:\~\#

[]{#VnetFe1DeleteMirror .anchor}**2.2.75.45 goes vnet fe1 delete
mirror**

-   **Command:**

> **root\@invader44:\~\$ goes vnet fe1 delete mirror**

-   **Description:**

> Fe1 deletes the mirror profile \<session name\>.

-   **Examples:**

> **root\@invader44:\~\# goes vnet fe1 delete mirror**
>
> root\@invader44:\~\#

[]{#VnetFe1DisableSflow .anchor}**2.2.75.46 goes vnet fe1 disable
sflow**

-   **Command:**

> **root\@invader44:\~\$ goes vnet fe1 disable sflow**

-   **Description:**

> Fe1 disables the sflow source\<ingress if name\>.

-   **Examples:**

> **root\@invader44:\~\# goes vnet fe1 disable sflow**
>
> root\@invader44:\~\#

[]{#VnetFe1EnableIngressMirroring .anchor}**2.2.75.47 goes vnet fe1
enable ingress mirroring**

-   **Command:**

> **root\@invader44:\~\$ goes vnet fe1 enable ingress mirroring**

-   **Description:**

> Fe1 enables ingress mirroring session \<mirror-session\> source
> \<if-name\> destination \<if-name\>.

-   **Examples:**

> **root\@invader44:\~\# goes vnet fe1 enable ingress mirroring**
>
> root\@invader44:\~\#

[]{#VnetFe1EnableSflow .anchor}**2.2.75.48 goes vnet fe1 enable sflow **

-   **Command:**

> **root\@invader44:\~\$ goes vnet fe1 enable sflow **

-   **Description:**

> Fe1 enables sflow source\<ingress if name\> cpu \<true/false\> mirror
> \<true/false\>.

-   **Examples:**

> **root\@invader44:\~\# goes vnet fe1 enable sflow **
>
> root\@invader44:\~\#

[]{#VnetFe1GetSflowCounters .anchor}**2.2.75.49 goes vnet fe1 get sflow
counters**

-   **Command:**

> **root\@invader44:\~\$ goes vnet fe1 get sflow counters**

-   **Description:**

> Efe1 gets sflow counters.

-   **Examples:**

> **root\@invader44:\~\# goes vnet fe1 get sflow counters**
>
> root\@invader44:\~\#

[]{#VnetFe1SetSflowMirrorEncapsulation .anchor}**2.2.75.50 goes vnet fe1
set mirror encapsulation**

-   **Command:**

> **root\@invader44:\~\$ goes vnet fe1 set mirror encapsulation**

-   **Description:**

> Fe1 sets mirror encapsulation session\<session-name\>
> destination\<if-name\> encap\<SFLOW/RSPAN/ERSPAN\>.

-   **Examples:**

> **root\@invader44:\~\# goes vnet fe1 set mirror encapsulation**
>
> root\@invader44:\~\#

[]{#VnetFe1SetSflowDefault .anchor}**2.2.75.51 goes vnet fe1 set sflow
default **

-   **Command:**

> **root\@invader44:\~\$ goes vnet fe1 set sflow default **

-   **Description:**

> Fe1 sets sflow default.

-   **Examples:**

> **root\@invader44:\~\# goes vnet fe1 set sflow default**
>
> root\@invader44:\~\#

[]{#VnetFe1SetSflowTarget .anchor}**2.2.75.52 goes vnet fe1 set sflow
target**

-   **Command:**

> **root\@invader44:\~\$ goes vnet fe1 set sflow target**

-   **Description:**

> Fe1 sets sflow target destination \<session name\>.

-   **Examples:**

> **root\@invader44:\~\# goes vnet fe1 set sflow target**
>
> root\@invader44:\~\#

[]{#VnetFe1ShowMirror .anchor}**2.2.75.53 goes vnet fe1 show mirror**

-   **Command:**

> **root\@invader44:\~\$ goes vnet fe1 show mirror**

-   **Description:**

> Fe1 shows mirror session \<session-name\>.

-   **Examples:**

> **root\@invader44:\~\# goes vnet fe1 show mirror**
>
> root\@invader44:\~\#

[]{#VnetFe1ShowSflowDetails .anchor}**2.2.75.54 goes vnet fe1 show sflow
details**

-   **Command:**

> **root\@invader44:\~\$ goes vnet fe1 show sflow details**

-   **Description:**

> Shows s-flow details of all ports.

-   **Examples:**

> **root\@invader44:\~\# goes vnet fe1 show sflow details**
>
> root\@invader44:\~\#

[]{#VnetI2CScan .anchor}**2.2.75.55 goes vnet i2c scan**

-   **Command:**

> **root\@invader44:\~\$ goes vnet i2c scan**

-   **Description:**

> ????????????.

-   **Examples:**

> **root\@invader44:\~\# goes vnet i2c scan**
>
> root\@invader44:\~\#

[]{#VnetIPInterface .anchor}**2.2.75.56 goes vnet ip interface**

-   **Command:**

> **root\@invader44:\~\$ goes vnet ip interface**

-   **Description:**

> IP interface commands.

-   **Examples:**

> **root\@invader44:\~\# goes vnet ip interface**
>
> root\@invader44:\~\#

[]{#VnetIPRoute .anchor}**2.2.75.57 goes vnet ip route**

-   **Command:**

> **root\@invader44:\~\$ goes vnet ip route**

-   **Description:**

> Adds/deletes the Ip4/Ip6 routes.

-   **Examples:**

> **root\@invader44:\~\# goes vnet ip route**
>
> root\@invader44:\~\#

[]{#VnetNetlinkLog .anchor}**2.2.75.58 goes vnet netlink log**

-   **Command:**

> **root\@invader44:\~\$ goes vnet netlink log**

-   **Description:**

> Enables/disables the netlink message logging.

-   **Examples:**

> **root\@invader44:\~\# goes vnet netlink log**
>
> root\@invader44:\~\#

[]{#VnetNetlinkRoute .anchor}**2.2.75.59 goes vnet netlink route**

-   **Command:**

> **root\@invader44:\~\$ goes vnet netlink route**

-   **Description:**

> Adds/deletes the Ip4/Ip6 routes via netlink.

-   **Examples:**

> **root\@invader44:\~\# goes vnet netlink route**
>
> root\@invader44:\~\#

[]{#VnetPacketGenerator .anchor}**2.2.75.60 goes vnet packet-generator**

-   **Command:**

> **root\@invader44:\~\$ goes vnet packet-generator**

-   **Description:**

> Edits or creates the packet generator streams.

-   **Examples:**

> **root\@invader44:\~\# goes vnet packet-generator**
>
> root\@invader44:\~\#

[]{#Vnet61SetFe1TrainRestart .anchor}**2.2.75.61 goes vnet set fe1
l\_train\_restart**

-   **Command:**

> **root\@invader44:\~\$ goes vnet set fe1 l\_train\_restart**

-   **Description:**

> Restarts the link training (initiate to remote).

-   **Examples:**

> **root\@invader44:\~\# goes vnet set fe1 l\_train\_restart**
>
> root\@invader44:\~\#

[]{#Vnet62SetFe1PMDRestart .anchor}**2.2.75.62 goes vnet set fe1
pmd\_restart**

-   **Command:**

> **root\@invader44:\~\$ goes vnet set fe1 pmd\_restart**

-   **Description:**

> Restarts the Rx equalization.

-   **Examples:**

> **root\@invader44:\~\# goes vnet set fe1 pmd\_restart**
>
> root\@invader44:\~\#

[]{#VnetSetFe1PortConfig .anchor}**2.2.75.63 goes vnet set fe1
port-config**

-   **Command:**

> **root\@invader44:\~\$ goes vnet set fe1 port-config**

-   **Description:**

> Sets fe1 port mac \[rf\|lf\] \[1\|0\].

-   **Examples:**

> **root\@invader44:\~\# goes vnet set fe1 port-config**
>
> root\@invader44:\~\#

[]{#VnetSetFe1ResetPort .anchor}**2.2.75.64 goes vnet set fe1
reset\_port**

-   **Command:**

> **root\@invader44:\~\$ goes vnet set fe1 reset\_port**

-   **Description:**

> Resets the port.

-   **Examples:**

> **root\@invader44:\~\# goes vnet set fe1 reset\_port**
>
> root\@invader44:\~\#

[]{#VnetSetFe1SerdesParam .anchor}**2.2.75.65 goes vnet set fe1
serdes-param**

-   **Command:**

> **root\@invader44:\~\$ goes vnet set fe1 serdes-param**

-   **Description:**

> Example: set fe1 serdes eth-1-1 lane 2 main 100 pre 12 post1 44 post2
> 0 post3 0 amp 8 drv 0 lte 0. (Description??????)

-   **Examples:**

> **root\@invader44:\~\# goes vnet set fe1 serdes-param**
>
> root\@invader44:\~\#

[]{#VnetSetHardwareInterfaces .anchor}**2.2.75.66 goes vnet set
hardware-interface**

-   **Command:**

> **root\@invader44:\~\$ goes vnet set hardware-interface**

-   **Description:**

> Sets the hardware interface commands.

-   **Examples:**

> **root\@invader44:\~\# goes vnet set hardware-interface**
>
> root\@invader44:\~\#

[]{#VnetSetInterfaces .anchor}**2.2.75.67 goes vnet set interface**

-   **Command:**

> **root\@invader44:\~\$ goes vnet set interface**

-   **Description:**

> Sets the interface commands.

-   **Examples:**

> **root\@invader44:\~\# goes vnet set interface**
>
> root\@invader44:\~\#

[]{#vnetd .anchor}**2.2.76 goes vnetd**

-   **Command:**

> **root\@invader44:\~\$ goes vnetd**

-   **Description:**

> FIXME.
>
> **\[root\@invader44:\~\# goes vnetd help**
>
> usage: vnetd
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes vnetd**

**2.2.77 goes wget**

-   **Command:**

> **root\@invader44:\~\$ goes wget**

-   **Description:**

> A non-interactive network downloader.
>
> **\[root\@invader44:\~\# goes wget help**
>
> usage: wget URL\...
>
> root\@invader44:\~\#**\]**

-   **Examples:**

> **root\@invader44:\~\# goes wget**

Chapter-3

[]{#_7fikqe1fta8y .anchor}

Coreboot Commands

Chapter-4

[]{#_hppj21iolha8 .anchor}

BMC Commands

[]{#BMCHGET .anchor}**4.1 Redis hget commands**

[]{#BMC1Temperature .anchor}**4.1.1 bmc.temperature**

-   **Command:**

> root\@invader45:\~\# **sudo redis-cli -h 172.17.3.44 hget platina**
>
> **\"bmc.temperature.units.C\"**

-   **Description:**

> Shows BMC processor current temperature.

-   **Examples:**

> root\@invader45:\~\# sudo redis-cli -h 172.17.3.44 hget platina
> \"bmc.temperature.units.C\"
>
> \"43.15\"
>
> root\@invader45:\~\#

[]{#BMC2CmdlineConsole .anchor}**4.1.2 cmdline.console**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"cmdline.console\"**

-   **Description:**

> ?????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"cmdline.console\"
>
> \"ttymxc0,115200n8\"
>
> root\@invader45:\~\#

[]{#BMC3CmdlineInit .anchor}**4.1.3 cmdline.init**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"cmdline.init\"**

-   **Description:**

> ?????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"cmdline.init\"
>
> \"/init\"
>
> root\@invader45:\~\#

[]{#BMC4CmdlineInitrd .anchor}**4.1.4 cmdline.initrd**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"cmdline.initrd\"**

-   **Description:**

> ?????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"cmdline.initrd\"
>
> \"0x89000000,3M\"
>
> root\@invader45:\~\#

[]{#BMC5CmdlineIP .anchor}**4.1.5 cmdline.ip**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"cmdline.ip\"**

-   **Description:**

> ?????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"cmdline.ip\"
>
> \"172.17.3.45::172.17.2.1:255.255.254.0::eth0:on\"
>
> root\@invader45:\~\#

[]{#BMC6CmdlineMem .anchor}**4.1.6 cmdline.mem**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"cmdline.mem\"**

-   **Description:**

> ?????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"cmdline.mem\"
>
> \"1024m\"
>
> root\@invader45:\~\#

[]{#BMC7CmdlineQuiet .anchor}**4.1.7 cmdline.quiet**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"cmdline.quiet\"**

-   **Description:**

> ?????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"cmdline.quiet\"
>
> \"true\"
>
> root\@invader45:\~\#

[]{#BMC8CmdlineRoot .anchor}**4.1.8 cmdline.root**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"cmdline.root\"**

-   **Description:**

> ?????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"cmdline.root\"
>
> \"/dev/ram0\"
>
> root\@invader45:\~\#

[]{#BMC9CmdlineRootfstype .anchor}**4.1.9 cmdline.rootfstype **

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"cmdline.rootfstype\"**

-   **Description:**

> Shows BMC processor\'s file system type.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"cmdline.rootfstype\"
>
> \"ext4\"
>
> root\@invader45:\~\#

[]{#BMC10CmdlineRootwait .anchor}**4.1.10 cmdline.rootwait**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"cmdline.rootwait\"**

-   **Description:**

> ?????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"cmdline.rootwait\"
>
> \"true\"
>
> root\@invader45:\~\#

[]{#BMC11CmdlineRW .anchor}**4.1.11 cmdline.rw**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"cmdline.rw\"**

-   **Description:**

> ?????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"cmdline.rw\"
>
> \"true\"
>
> root\@invader45:\~\#

[]{#BMC12CmdlineStart .anchor}**4.1.12 cmdline.start**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"cmdline.start\"**

-   **Description:**

> ?????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"cmdline.start\"
>
> \"true\"
>
> root\@invader45:\~\#

[]{#BMC13EEPROM .anchor}**4.1.13 eeprom.BaseEthernetAddress**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"eeprom.BaseEthernetAddress\"**

-   **Description:**

> Shows mac address of BMC management interface.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"eeprom.BaseEthernetAddress\"
>
> \"50:18:4c:00:15:98\"
>
> root\@invader45:\~\#

[]{#BMC14EEPROMCRC .anchor}**4.1.14 eeprom.Crc**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"eeprom.Crc\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"eeprom.Crc\"
>
> \"0xd2c4147a\"
>
> root\@invader45:\~\#

[]{#BMC15EepromDeviceVersion .anchor}**4.1.15 eeprom.DeviceVersion**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"eeprom.DeviceVersion\"**

-   **Description:**

> Shows BMC eprom device version.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"eeprom.DeviceVersion\"
>
> \"0x0a\"
>
> root\@invader45:\~\#

[]{#BMC16EepromManufactureDate .anchor}**4.1.16 eeprom.ManufactureDate**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"eeprom.ManufactureDate\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"eeprom.ManufactureDate\"
>
> \"2017/06/27 13:38:39\"
>
> root\@invader45:\~\#

[]{#BMC17EepromNEthernetAddress .anchor}**4.1.17
eeprom.NEthernetAddress**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"eeprom.NEthernetAddress\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"eeprom.NEthernetAddress\"
>
> \"132\"
>
> root\@invader45:\~\#

[]{#BMC18EepromOnieData .anchor}**4.1.18 eeprom.Onie.Data**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"eeprom.Onie.Data\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"eeprom.Onie.Data\"
>
> \"\\\"TlvInfo\\\\x00\\\" 0x546c76496e666f00\"
>
> root\@invader45:\~\#

[]{#BMC19EepromOnieVersion .anchor}**4.1.19 eeprom.Onie.Version**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"eeprom.Onie.Version\"**

-   **Description:**

> Shows eprom Onie Version.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"eeprom.Onie.Version\"
>
> \"0x01\"
>
> root\@invader45:\~\#

[]{#BMC20EepromPartNumber .anchor}**4.1.20 eeprom.PartNumber**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"eeprom.PartNumber\"**

-   **Description:**

> Shows eeprom part info.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"eeprom.PartNumber\"
>
> \"PS-3001-32C-AFA\"
>
> root\@invader45:\~\#

[]{#BMC21EepromPlatformName .anchor}**4.1.21 eeprom.PlatformName**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"eeprom.PlatformName\"**

-   **Description:**

> Shows eeprom platform name.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"eeprom.PlatformName\"
>
> \"X86-BDE-4C-16GB-128GB\"
>
> root\@invader45:\~\#

[]{#BMC22EepromSerialNumber .anchor}**4.1.22 eeprom.SerialNumber**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"eeprom.SerialNumber\"**

-   **Description:**

> Shows eeprom serial number.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"eeprom.SerialNumber\"
>
> \"FDU1757A0000B\"
>
> root\@invader45:\~\#

[]{#BMC23EepromVendor .anchor}**4.1.23 eeprom.Vendor**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"eeprom.Vendor\"**

-   **Description:**

> Shows eeprom vendor name.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"eeprom.Vendor\"
>
> \"Platina Systems\"
>
> root\@invader45:\~\#

**4.1.24 eeprom.VendorExtension**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"eeprom.VendorExtension\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"eeprom.VendorExtension\"
>
> \"\\\"\\\\x00\\\\x00\\\\xbceP\\\\x01\\\\x00Q\\\\x01\\\\x00R\\\\x01\\\\nS\\\\x0e900-000000-000T\\\\x10main.HB1N7150012T\\\\x0fcpu.HB2N7150007T\\\\x0ffan.HB4N7100019\\\"\"
>
> root\@invader45:\~\#

[]{#BMC25Fan_Tray1Speed .anchor}**4.1.25 fan\_tray.1.1.speed.units.rpm**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"fan\_tray.1.1.speed.units.rpm\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"fan\_tray.1.1.speed.units.rpm\"
>
> \"4066\"
>
> root\@invader45:\~\#

[]{#BMC26Fan_Tray2Speed .anchor}**4.1.26 fan\_tray.1.2.speed.units.rpm**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"fan\_tray.1.2.speed.units.rpm\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"fan\_tray.1.2.speed.units.rpm\"
>
> \"4029\"
>
> root\@invader45:\~\#

[]{#BMC27Fan_Tray1Status .anchor}**4.1.27 fan\_tray.1.status**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"fan\_tray.1.status\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"fan\_tray.1.status\"
>
> \"ok.front-\>back\"
>
> root\@invader45:\~\#

[]{#BMC28Fan_Tray2Speed .anchor}**4.1.28 fan\_tray.2.1.speed.units.rpm**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"fan\_tray.2.1.speed.units.rpm\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"fan\_tray.2.1.speed.units.rpm\"
>
> \"4115\"
>
> root\@invader45:\~\#

[]{#BMC29Fan_Tray22Speed .anchor}**4.1.29
fan\_tray.2.2.speed.units.rpm**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"fan\_tray.2.2.speed.units.rpm\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"fan\_tray.2.2.speed.units.rpm\"
>
> \"4103\"
>
> root\@invader45:\~\#

[]{#BMC30Fan_Tray2Status .anchor}**4.1.30 fan\_tray.2.status**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"fan\_tray.2.status\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"fan\_tray.2.status\"
>
> \"ok.front-\>back\"
>
> root\@invader45:\~\#

[]{#BMC31Fan_Tray3SpeedUnits .anchor}**4.1.31
fan\_tray.3.1.speed.units.rpm**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"fan\_tray.3.1.speed.units.rpm\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"fan\_tray.3.1.speed.units.rpm\"
>
> \"4258\"
>
> root\@invader45:\~\#

[]{#BMC32Fan_Tray32SpeedUnits .anchor}**4.1.32
fan\_tray.3.2.speed.units.rpm**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"fan\_tray.3.2.speed.units.rpm\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"fan\_tray.3.2.speed.units.rpm\"
>
> \"4128\"
>
> root\@invader45:\~\#

[]{#BMC33Fan_Tray3Status .anchor}**4.1.33 fan\_tray.3.status**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"fan\_tray.3.status\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"fan\_tray.3.status\"
>
> \"ok.front-\>back\"
>
> root\@invader45:\~\#

[]{#BMC34Fan_Tray41SpeedUnits .anchor}**4.1.34
fan\_tray.4.1.speed.units.rpm**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"fan\_tray.4.1.speed.units.rpm\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"fan\_tray.4.1.speed.units.rpm\"
>
> \"4218\"
>
> root\@invader45:\~\#

[]{#BMC35Fan_Tray42SpeedUnits .anchor}**4.1.35
fan\_tray.4.2.speed.units.rpm**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"fan\_tray.4.2.speed.units.rpm\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"fan\_tray.4.2.speed.units.rpm\"
>
> \"4054\"
>
> root\@invader45:\~\#

[]{#BMC36Fan_Tray4Status .anchor}**4.1.36 fan\_tray.4.status**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"fan\_tray.4.status\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"fan\_tray.4.status\"
>
> \"ok.front-\>back\"
>
> root\@invader45:\~\#

[]{#BMC37Fan_TrayDuty .anchor}**4.1.37 fan\_tray.duty**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"fan\_tray.duty\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"fan\_tray.duty\"
>
> \"0x30\"
>
> root\@invader45:\~\#

[]{#BMC38Fan_TraySpeed .anchor}**4.1.38 fan\_tray.speed**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"fan\_tray.speed\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"fan\_tray.speed\"
>
> \"auto\"
>
> root\@invader45:\~\#

[]{#BMC39HostTempTarget .anchor}**4.1.39 host.temp.target.units.C**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"host.temp.target.units.C\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"host.temp.target.units.C\"
>
> \"70.00\"
>
> root\@invader45:\~\#

[]{#BMC40HostTempUnits .anchor}**4.1.40 host.temp.units.C**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"host.temp.units.C\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"host.temp.units.C\"
>
> \"50.00\"
>
> root\@invader45:\~\#

[]{#BMC41Hostname .anchor}**4.1.41 hostname**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"hostname\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"hostname\"
>
> \"172.17.3.45\"
>
> root\@invader45:\~\#

[]{#BMC42HwmonFrontTemp .anchor}**4.1.42 hwmon.front.temp.units.C**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"hwmon.front.temp.units.C\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"hwmon.front.temp.units.C\"
>
> \"46.250\"
>
> root\@invader45:\~\#

[]{#BMC43HwmonRearTemp .anchor}**4.1.43 hwmon.rear.temp.units.C**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina \"**
> **hwmon.rear.temp.units.C \"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"hwmon.rear.temp.units.C\"
>
> \"50.250\"
>
> root\@invader45:\~\#

[]{#BMC44HwmonTargetsUnits .anchor}**4.1.44 hwmon.target.units.C**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"hwmon.target.units.C\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"hwmon.target.units.C\"
>
> \"50\"
>
> root\@invader45:\~\#

[]{#BMC45Machine .anchor}**4.1.45 machine**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"machine\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina \"machine\"
>
> \"platina-mk1-bmc\"
>
> root\@invader45:\~\#

[]{#BMC46PsuPowercycle .anchor}**4.1.46 psu.powercycle**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"psu.powercycle\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"psu.powercycle\"
>
> \"true\"
>
> root\@invader45:\~\#

[]{#BMC47Psu1AdminState .anchor}**4.1.47 psu1.admin.state**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"psu1.admin.state\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"psu1.admin.state\"
>
> \"enabled\"
>
> root\@invader45:\~\#

[]{#BMC48Psu1Eeprom .anchor}**4.1.48 psu1.eeprom**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"psu1.eeprom\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"psu1.eeprom\"
>
> \"01000000010900f5010819c54757202020cb47572d4352505335353020ca58585858585858585858c3585846ce5053555134303030313132475720c0c0c10000000000000000003200021822c42602390319052823b036504620672f3f0c1f94c20000001f01020d09e701b0047404ec047800e803c8af01820d274982b0047404ec0478000000b80b2020202020202020202020202020202020202020202020202020202020202020202020202020202020202020202020202020202020202020202020202020202020202020202020202020202020202020202020202020202020202020202020202020202020202020202020202020202020202020202020\"
>
> root\@invader45:\~\#

**4.1.49 psu1.fan\_direction**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina \"**
> **psu1.fan\_direction \"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"psu1.fan\_direction\"
>
> \"front-\>back\"
>
> root\@invader45:\~\#

[]{#BMC50Psu1FanSpeedUnits .anchor}**4.1.50 psu1.fan\_speed.units.rpm**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"psu1.fan\_speed.units.rpm\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"psu1.fan\_speed.units.rpm\"
>
> \"0\"
>
> root\@invader45:\~\#

[]{#BMC51Psu1I_OutUnits .anchor}**4.1.51 psu1.i\_out.units.A**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"psu1.i\_out.units.A\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"psu1.i\_out.units.A\"
>
> \"0.019\"
>
> root\@invader45:\~\#

[]{#BMC52Psu1Mfg_Id .anchor}**4.1.52 psu1.mfg\_id**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"psu1.mfg\_id\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"psu1.mfg\_id\"
>
> \"Great Wall\"
>
> root\@invader45:\~\#

[]{#BMC53Psu1Mfg_Model .anchor}**4.1.53 psu1.mfg\_model**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"psu1.mfg\_model\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"psu1.mfg\_model\"
>
> \"CRPS550\"
>
> root\@invader45:\~\#

[]{#BMC54Psu1PInUnitsW .anchor}**4.1.54 psu1.p\_in.units.W**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"psu1.p\_in.units.W\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"psu1.p\_in.units.W\"
>
> \"0.000\"
>
> root\@invader45:\~\#

[]{#BMC55Psu1POutUnitsW .anchor}**4.1.55 psu1.p\_out.units.W**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"psu1.p\_out.units.W\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"psu1.p\_out.units.W\"
>
> \"0.000\"
>
> root\@invader45:\~\#

[]{#BMC56Psu1Sn .anchor}**4.1.56 psu1.sn**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"psu1.sn\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina \"psu1.sn\"
>
> \"PSUQ4000112GW\"
>
> root\@invader45:\~\#

[]{#BMC57Psu1Status .anchor}**4.1.57 psu1.status**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina \"**
> **psu1.status \"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"psu1.status\"
>
> \"powered\_off\"
>
> root\@invader45:\~\#

[]{#BMC58Psu1Temp1Units .anchor}**4.1.58 psu1.temp1.units.C**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina \"**
> **psu1.temp1.units.C\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"psu1.temp1.units.C\"
>
> \"33.250\"
>
> root\@invader45:\~\#

[]{#BMC59Psu1Temp2Units .anchor}**4.1.59 psu1.temp2.units.C**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina \"**
> **psu1.temp2.units.C\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"psu1.temp2.units.C\"
>
> \"29.344\"
>
> root\@invader45:\~\#

[]{#BMC60Psu1VInUnits .anchor}**4.1.60 psu1.v\_in.units.V**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"psu1.v\_in.units.V\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"psu1.v\_in.units.V\"
>
> \"0.000\"
>
> root\@invader45:\~\#

[]{#BMC61Psu1VOutUnits .anchor}**4.1.61 psu1.v\_out.units.V**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"psu1.v\_out.units.V\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"psu1.v\_out.units.V\"
>
> \"0.000\"
>
> root\@invader45:\~\#

[]{#BMC62Psu2AdminState .anchor}**4.1.62 psu2.admin.state**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina \"**
> **psu2.admin.state \"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina \"
> psu2.admin.state \"
>
> \"enabled\"
>
> root\@invader45:\~\#

[]{#BMC63PSU2Eeprom .anchor}**4.1.63 psu2.eeprom**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"psu2.eeprom\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"psu2.eeprom\"
>
> \"
> 01000000010900f5010819c54757202020cb47572d4352505335353020ca58585858585858585858c3585846ce5053555134303030313131475720c0c0c10000000000000000003300021822c42602390319052823b036504620672f3f0c1f94c20000001f01020d09e701b0047404ec047800e803c8af01820d274982b0047404ec0478000000b80b2020202020202020202020202020202020202020202020202020202020202020202020202020202020202020202020202020202020202020202020202020202020202020202020202020202020202020202020202020202020202020202020202020202020202020202020202020202020202020202020
> \"
>
> root\@invader45:\~\#

[]{#BMC64PSU2FanDirection .anchor}**4.1.64 psu2.fan\_direction**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina \"**
> **psu2.fan\_direction \"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"psu2.fan\_direction\"
>
> \"front-\>back\"
>
> root\@invader45:\~\#

[]{#BMC65PSU2FanSpeedUnits .anchor}**4.1.65 psu2.fan\_speed.units.rpm**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"psu2.fan\_speed.units.rpm\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"psu2.fan\_speed.units.rpm\"
>
> \"4680\"
>
> root\@invader45:\~\#

[]{#BMC66PSU2IOutUnits .anchor}**4.1.66 psu2.i\_out.units.A**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"psu2.i\_out.units.A\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"psu2.i\_out.units.A\"
>
> \"11.031\"
>
> root\@invader45:\~\#

[]{#BMC67PSU2MfgID .anchor}**4.1.67 psu2.mfg\_id**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"psu2.mfg\_id\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"psu2.mfg\_id\"
>
> \"Great Wall\"
>
> root\@invader45:\~\#

[]{#BMC68PSU2MfgModel .anchor}**4.1.68 psu2.mfg\_model**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"psu2.mfg\_model\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"psu2.mfg\_model\"
>
> \"CRPS550\"
>
> root\@invader45:\~\#

[]{#BMC69PSU2PInUnits .anchor}**4.1.69 psu2.p\_in.units.W**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"psu2.p\_in.units.W\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"psu2.p\_in.units.W\"
>
> \"147.000\"
>
> root\@invader45:\~\#

[]{#BMC70PSU2POutUnits .anchor}**4.1.70 psu2.p\_out.units.W**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"psu2.p\_out.units.W\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"psu2.p\_out.units.W\"
>
> \"133.000\"
>
> root\@invader45:\~\#

[]{#BMC71PSU2Sn .anchor}**4.1.71 psu2.sn**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"psu2.sn\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina \"psu2.sn\"
>
> \"PSUQ4000111GW\"
>
> root\@invader45:\~\#

**4.1.72 psu2.status**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina \"**
> **psu2.status \"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"psu2.status\"
>
> \"powered\_on\"
>
> root\@invader45:\~\#

[]{#BMC73PSU2Temp1Units .anchor}**4.1.73 psu2.temp1.units.C**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina \"**
> **psu2.temp1.units.C\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"psu2.temp1.units.C\"
>
> \"36.688\"
>
> root\@invader45:\~\#

[]{#BMC74PSU2Temp2Units .anchor}**4.1.74 psu2.temp2.units.C**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina \"**
> **psu2.temp2.units.C\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"psu2.temp2.units.C\"
>
> \"42.125\"
>
> root\@invader45:\~\#

[]{#BMC75PSU2VIn .anchor}**4.1.75 psu2.v\_in.units.V**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"psu2.v\_in.units.V\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"psu2.v\_in.units.V\"
>
> \"122.000\"
>
> root\@invader45:\~\#

[]{#BMC76PSU2VOutUnits .anchor}**4.1.76 psu2.v\_out.units.V**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"psu2.v\_out.units.V\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"psu2.v\_out.units.V\"
>
> \"12.047\"
>
> root\@invader45:\~\#

[]{#BMC77RedisReady .anchor}**4.1.77 redis.ready**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"redis.ready\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"redis.ready\"
>
> \"true\"
>
> root\@invader45:\~\#

[]{#BMC78SysCpuLoad1 .anchor}**4.1.78 sys.cpu.load1**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"sys.cpu.load1\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"sys.cpu.load1\"
>
> \"0.08\"
>
> root\@invader45:\~\#

[]{#BMC79SysCpuLoad10 .anchor}**4.1.79 sys.cpu.load10**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"sys.cpu.load10\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"sys.cpu.load10\"
>
> \"0.64\"
>
> root\@invader45:\~\#

[]{#BMC80SysCpuLoad15 .anchor}**4.1.80 sys.cpu.load15**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"sys.cpu.load15\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"sys.cpu.load15\"
>
> \"0.58\"
>
> root\@invader45:\~\#

[]{#BMC81SysMemBuffer .anchor}**4.1.81 sys.mem.buffer**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"sys.mem.buffer\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"sys.mem.buffer\"
>
> \"352256\"
>
> root\@invader45:\~\#

**4.1.82 sys.mem.free**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"sys.mem.free\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"sys.mem.free\"
>
> \"938221568\"
>
> root\@invader45:\~\#

**\
**[]{#BMC83SysMemShared .anchor}**4.1.83 sys.mem.shared**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"sys.mem.shared\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"sys.mem.shared\"
>
> \"4096\"
>
> root\@invader45:\~\#

[]{#BMC84SysMemTotal .anchor}**4.1.84 sys.mem.total**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"sys.mem.total\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"sys.mem.total\"
>
> \"1058603008\"
>
> root\@invader45:\~\#

[]{#BMC85SysUptime .anchor}**4.1.85 sys.uptime**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"sys.uptime\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"sys.uptime\"
>
> \"5 weeks, 9 hours, 42 minutes\"
>
> root\@invader45:\~\#

**4.1.86 system.fan\_direction**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"system.fan\_direction\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"system.fan\_direction\"
>
> \"front-\>back\"
>
> root\@invader45:\~\#

[]{#BMC87Vmon1v0ThaUnits .anchor}**4.1.87 vmon.1v0.tha.units.V**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina \"**
> **vmon.1v0.tha.units.V \"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"vmon.1v0.tha.units.V\"
>
> \"1.04\"
>
> root\@invader45:\~\#

[]{#BMC88Vmon1v0ThcUnits .anchor}**4.1.88 vmon.1v0.thc.units.V**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina \"**
> **vmon.1v0.thc.units.V \"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"vmon.1v0.thc.units.V\"
>
> \"1.016\"
>
> root\@invader45:\~\#

[]{#BMC89Vmon1v2EthxUnits .anchor}**4.1.89 vmon.1v2.ethx.units.V**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"vmon.1v2.ethx.units.V\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"vmon.1v2.ethx.units.V\"
>
> \"1.182\"
>
> root\@invader45:\~\#

[]{#BMC90Vmon1v25SysUnits .anchor}**4.1.90 vmon.1v25.sys.units.V**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"vmon.1v25.sys.units.V\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"vmon.1v25.sys.units.V\"
>
> \"1.237\"
>
> root\@invader45:\~\#

[]{#BMC91Vmon1v8SysUnits .anchor}**4.1.91 vmon.1v8.sys.units.V**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"vmon.1v8.sys.units.V\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"vmon.1v8.sys.units.V\"
>
> \"1.805\"
>
> root\@invader45:\~\#

[]{#BMC92Vmon3v3BmcUnits .anchor}**4.1.92 vmon.3v3.bmc.units.V**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"vmon.3v3.bmc.units.V\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"vmon.3v3.bmc.units.V\"
>
> \"3.32\"
>
> root\@invader45:\~\#

[]{#BMC93Vmon3v3SbUnits .anchor}**4.1.93 vmon.3v3.sb.units.V**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"vmon.3v3.sb.units.V\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"vmon.3v3.sb.units.V\"
>
> \"3.334\"
>
> root\@invader45:\~\#

[]{#BMC94Vmon3v3SysUnits .anchor}**4.1.94 vmon.3v3.sys.units.V**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"vmon.3v3.sys.units.V\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"vmon.3v3.sys.units.V\"
>
> \"3.276\"
>
> root\@invader45:\~\#

[]{#BMC95Vmon3v8BmcUnits .anchor}**4.1.95 vmon.3v8.bmc.units.V**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"vmon.3v8.bmc.units.V\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"vmon.3v8.bmc.units.V\"
>
> \"3.83\"
>
> root\@invader45:\~\#

[]{#BMC96Vmon5vSbUnits .anchor}**4.1.96 vmon.5v.sb.units.V**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"vmon.5v.sb.units.V\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"vmon.5v.sb.units.V\"
>
> \"5.051\"
>
> root\@invader45:\~\#

[]{#BMC97VmonPoweroffEvents .anchor}**4.1.97 vmon.poweroff.events**

-   **Command:**

> root\@invader45:\~\# **redis-cli -h 172.17.3.45 hget platina
> \"vmon.poweroff.events\"**

-   **Description:**

> ??????.

-   **Examples:**

> root\@invader45:\~\# redis-cli -h 172.17.3.45 hget platina
> \"vmon.poweroff.events\"
>
> \"1970-01-01T06:33:01Z.1970-01-01T07:07:34Z.1970-01-01T10:45:47Z.1970-01-01T02:43:25Z.1970-01-01T16:21:11Z\"
>
> root\@invader45:\~\#

[]{#BMCHSET .anchor}**4.2 Redis hset commands**

-   **Command:**

> redis-cli -h 172.17.3.43 hset platina psu.powercycle true
>
> 1

-   **Description:**

> Power cycle host

-   **Examples:**

> sandeep\@invader44:\~\$ redis-cli -h 172.17.3.43 hset platina
> psu.powercycle true
>
> 1
